<!-- terragrunt-plan -->
### :seedling: Terragrunt Plan (env: **dev**)
**Status**: success
**Log**: [📦 terragrunt-plan log](https://github.com/kuma0128/terraform-openmetadata-aws-assets/actions/runs/15921884159/artifacts/3417357487)

<details><summary>Show plan output</summary>

```terraform
08:32:12.834 INFO   The stack at . will be processed in the following order for command plan:
Group 1
- Module ./cicd

Group 2
- Module ./backend

Group 3
- Module ./dns

Group 4
- Module ./aws


08:32:13.036 INFO   [cicd] Downloading Terraform configurations from ../../../.. into ./cicd/.terragrunt-cache/h82z1OolwFBY1ROsIWPS9NYghzo/vxdbUoFBPPcfo8ey7QUdnvPtOeY
08:32:13.811 INFO   [cicd] terraform: Initializing the backend...
08:32:15.012 INFO   [cicd] terraform: 
08:32:15.012 INFO   [cicd] terraform: Successfully configured the backend "s3"! Terraform will automatically
08:32:15.012 INFO   [cicd] terraform: use this backend unless the backend configuration changes.
08:32:15.299 INFO   [cicd] terraform: Initializing modules...
08:32:15.300 INFO   [cicd] terraform: - iam_github_oidc in ../../../modules/cicd/iam_github_oidc
08:32:15.301 INFO   [cicd] terraform: Initializing provider plugins...
08:32:15.301 INFO   [cicd] terraform: - Finding hashicorp/random versions matching "~> 3.7.2"...
08:32:15.476 INFO   [cicd] terraform: - Finding latest version of hashicorp/tls...
08:32:15.584 INFO   [cicd] terraform: - Finding hashicorp/aws versions matching "~> 6.0.0"...
08:32:15.640 INFO   [cicd] terraform: - Finding hashicorp/http versions matching "~> 3.5.0"...
08:32:15.957 INFO   [cicd] terraform: - Installing hashicorp/random v3.7.2...
08:32:16.269 INFO   [cicd] terraform: - Installed hashicorp/random v3.7.2 (signed by HashiCorp)
08:32:16.464 INFO   [cicd] terraform: - Installing hashicorp/tls v4.1.0...
08:32:16.818 INFO   [cicd] terraform: - Installed hashicorp/tls v4.1.0 (signed by HashiCorp)
08:32:17.010 INFO   [cicd] terraform: - Installing hashicorp/aws v6.0.0...
08:32:21.281 INFO   [cicd] terraform: - Installed hashicorp/aws v6.0.0 (signed by HashiCorp)
08:32:21.429 INFO   [cicd] terraform: - Installing hashicorp/http v3.5.0...
08:32:21.761 INFO   [cicd] terraform: - Installed hashicorp/http v3.5.0 (signed by HashiCorp)
08:32:21.761 INFO   [cicd] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
08:32:21.761 INFO   [cicd] terraform: selections it made above. Include this file in your version control repository
08:32:21.761 INFO   [cicd] terraform: so that Terraform can guarantee to make the same selections by default when
08:32:21.761 INFO   [cicd] terraform: you run "terraform init" in the future.
08:32:21.761 INFO   [cicd] terraform: Terraform has been successfully initialized!
08:32:21.765 INFO   [cicd] Executing hook: fmt
08:32:21.788 INFO   [cicd] Executing hook: validate
Success! The configuration is valid.

08:32:27.536 STDOUT [cicd] terraform: module.iam_github_oidc.data.http.github_actions_openid_configuration: Reading...
08:32:27.662 STDOUT [cicd] terraform: module.iam_github_oidc.data.http.github_actions_openid_configuration: Read complete after 0s [id=https://token.actions.githubusercontent.com/.well-known/openid-configuration]
08:32:27.666 STDOUT [cicd] terraform: module.iam_github_oidc.data.tls_certificate.github_actions: Reading...
08:32:27.767 STDOUT [cicd] terraform: module.iam_github_oidc.data.tls_certificate.github_actions: Read complete after 0s [id=772ed8785f2c647baa040d3a1b4aa6cafacb6267]
08:32:28.292 STDOUT [cicd] terraform: Terraform used the selected providers to generate the following execution
08:32:28.292 STDOUT [cicd] terraform: plan. Resource actions are indicated with the following symbols:
08:32:28.292 STDOUT [cicd] terraform:   + create
08:32:28.292 STDOUT [cicd] terraform: Terraform will perform the following actions:
08:32:28.292 STDOUT [cicd] terraform:   # module.iam_github_oidc.aws_iam_openid_connect_provider.this will be created
08:32:28.292 STDOUT [cicd] terraform:   + resource "aws_iam_openid_connect_provider" "this" {
08:32:28.293 STDOUT [cicd] terraform:       + arn             = (known after apply)
08:32:28.293 STDOUT [cicd] terraform:       + client_id_list  = [
08:32:28.293 STDOUT [cicd] terraform:           + "sts.amazonaws.com",
08:32:28.293 STDOUT [cicd] terraform:         ]
08:32:28.293 STDOUT [cicd] terraform:       + id              = (known after apply)
08:32:28.293 STDOUT [cicd] terraform:       + tags_all        = (known after apply)
08:32:28.293 STDOUT [cicd] terraform:       + thumbprint_list = [
08:32:28.293 STDOUT [cicd] terraform:           + "2b18947a6a9fc7764fd8b5fb18a863b0c6dac24f",
08:32:28.293 STDOUT [cicd] terraform:           + "dd55b4520291e276588f0dd02fafd83a7368e0fa",
08:32:28.294 STDOUT [cicd] terraform:           + "7560d6f40fa55195f740ee2b1b7c0b4836cbe103",
08:32:28.294 STDOUT [cicd] terraform:         ]
08:32:28.294 STDOUT [cicd] terraform:       + url             = "https://token.actions.githubusercontent.com"
08:32:28.294 STDOUT [cicd] terraform:     }
08:32:28.294 STDOUT [cicd] terraform:   # module.iam_github_oidc.aws_iam_role.this will be created
08:32:28.294 STDOUT [cicd] terraform:   + resource "aws_iam_role" "this" {
08:32:28.295 STDOUT [cicd] terraform:       + arn                   = (known after apply)
08:32:28.295 STDOUT [cicd] terraform:       + assume_role_policy    = (known after apply)
08:32:28.295 STDOUT [cicd] terraform:       + create_date           = (known after apply)
08:32:28.295 STDOUT [cicd] terraform:       + force_detach_policies = false
08:32:28.295 STDOUT [cicd] terraform:       + id                    = (known after apply)
08:32:28.295 STDOUT [cicd] terraform:       + managed_policy_arns   = (known after apply)
08:32:28.295 STDOUT [cicd] terraform:       + max_session_duration  = 3600
08:32:28.295 STDOUT [cicd] terraform:       + name                  = "ethan-dev-iamrole-apne1-oidc"
08:32:28.295 STDOUT [cicd] terraform:       + name_prefix           = (known after apply)
08:32:28.296 STDOUT [cicd] terraform:       + path                  = "/"
08:32:28.296 STDOUT [cicd] terraform:       + tags_all              = (known after apply)
08:32:28.296 STDOUT [cicd] terraform:       + unique_id             = (known after apply)
08:32:28.296 STDOUT [cicd] terraform:       + inline_policy (known after apply)
08:32:28.296 STDOUT [cicd] terraform:     }
08:32:28.296 STDOUT [cicd] terraform:   # module.iam_github_oidc.aws_iam_role_policy_attachment.this will be created
08:32:28.296 STDOUT [cicd] terraform:   + resource "aws_iam_role_policy_attachment" "this" {
08:32:28.296 STDOUT [cicd] terraform:       + id         = (known after apply)
08:32:28.296 STDOUT [cicd] terraform:       + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
08:32:28.296 STDOUT [cicd] terraform:       + role       = "ethan-dev-iamrole-apne1-oidc"
08:32:28.296 STDOUT [cicd] terraform:     }
08:32:28.296 STDOUT [cicd] terraform: Plan: 3 to add, 0 to change, 0 to destroy.
08:32:28.297 STDOUT [cicd] terraform: 
08:32:28.305 INFO   [backend] Downloading Terraform configurations from ../../../.. into ./backend/.terragrunt-cache/VzF6bAw0aoltoYNo-Owt1TlKJYU/vxdbUoFBPPcfo8ey7QUdnvPtOeY
08:32:28.959 INFO   [backend] terraform: Initializing the backend...
08:32:30.200 INFO   [backend] terraform: 
08:32:30.200 INFO   [backend] terraform: Successfully configured the backend "s3"! Terraform will automatically
08:32:30.200 INFO   [backend] terraform: use this backend unless the backend configuration changes.
08:32:30.487 INFO   [backend] terraform: Initializing modules...
08:32:30.488 INFO   [backend] terraform: - backend in ../../../modules/backend
08:32:30.489 INFO   [backend] terraform: Initializing provider plugins...
08:32:30.489 INFO   [backend] terraform: - Finding hashicorp/random versions matching "~> 3.7.2"...
08:32:30.598 INFO   [backend] terraform: - Finding hashicorp/aws versions matching "~> 6.0.0"...
08:32:30.673 INFO   [backend] terraform: - Finding hashicorp/http versions matching "~> 3.5.0"...
08:32:30.932 INFO   [backend] terraform: - Installing hashicorp/random v3.7.2...
08:32:31.263 INFO   [backend] terraform: - Installed hashicorp/random v3.7.2 (signed by HashiCorp)
08:32:31.442 INFO   [backend] terraform: - Installing hashicorp/aws v6.0.0...
08:32:36.958 INFO   [backend] terraform: - Installed hashicorp/aws v6.0.0 (signed by HashiCorp)
08:32:37.110 INFO   [backend] terraform: - Installing hashicorp/http v3.5.0...
08:32:37.392 INFO   [backend] terraform: - Installed hashicorp/http v3.5.0 (signed by HashiCorp)
08:32:37.392 INFO   [backend] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
08:32:37.393 INFO   [backend] terraform: selections it made above. Include this file in your version control repository
08:32:37.393 INFO   [backend] terraform: so that Terraform can guarantee to make the same selections by default when
08:32:37.393 INFO   [backend] terraform: you run "terraform init" in the future.
08:32:37.393 INFO   [backend] terraform: Terraform has been successfully initialized!
08:32:37.396 INFO   [backend] Executing hook: fmt
08:32:37.418 INFO   [backend] Executing hook: validate
Success! The configuration is valid.

08:32:43.609 STDOUT [backend] terraform: module.backend.data.aws_s3_bucket.this: Reading...
08:32:44.393 STDOUT [backend] terraform: module.backend.data.aws_s3_bucket.this: Read complete after 0s [id=ethan-s3-apne1-tfstate]
08:32:44.525 STDOUT [backend] terraform: Terraform used the selected providers to generate the following execution
08:32:44.525 STDOUT [backend] terraform: plan. Resource actions are indicated with the following symbols:
08:32:44.525 STDOUT [backend] terraform:   + create
08:32:44.525 STDOUT [backend] terraform: Terraform will perform the following actions:
08:32:44.525 STDOUT [backend] terraform:   # module.backend.aws_s3_bucket_policy.this will be created
08:32:44.526 STDOUT [backend] terraform:   + resource "aws_s3_bucket_policy" "this" {
08:32:44.526 STDOUT [backend] terraform:       + bucket = "ethan-s3-apne1-tfstate"
08:32:44.526 STDOUT [backend] terraform:       + id     = (known after apply)
08:32:44.526 STDOUT [backend] terraform:       + policy = jsonencode(
08:32:44.526 STDOUT [backend] terraform:             {
08:32:44.526 STDOUT [backend] terraform:               + Statement = [
08:32:44.526 STDOUT [backend] terraform:                   + {
08:32:44.526 STDOUT [backend] terraform:                       + Action    = "s3:*"
08:32:44.526 STDOUT [backend] terraform:                       + Condition = {
08:32:44.526 STDOUT [backend] terraform:                           + NotIpAddress    = {
08:32:44.526 STDOUT [backend] terraform:                               + "aws:SourceIp" = [
08:32:44.526 STDOUT [backend] terraform:                                   + "192.0.2.0/24",
08:32:44.526 STDOUT [backend] terraform:                                 ]
08:32:44.526 STDOUT [backend] terraform:                             }
08:32:44.526 STDOUT [backend] terraform:                           + StringNotEquals = {
08:32:44.526 STDOUT [backend] terraform:                               + "aws:SourceVpce" = []
08:32:44.527 STDOUT [backend] terraform:                             }
08:32:44.527 STDOUT [backend] terraform:                           + StringNotLike   = {
08:32:44.527 STDOUT [backend] terraform:                               + "aws:userid" = []
08:32:44.527 STDOUT [backend] terraform:                             }
08:32:44.527 STDOUT [backend] terraform:                         }
08:32:44.527 STDOUT [backend] terraform:                       + Effect    = "Deny"
08:32:44.527 STDOUT [backend] terraform:                       + Principal = "*"
08:32:44.527 STDOUT [backend] terraform:                       + Resource  = [
08:32:44.527 STDOUT [backend] terraform:                           + "arn:aws:s3:::ethan-s3-apne1-tfstate",
08:32:44.527 STDOUT [backend] terraform:                           + "arn:aws:s3:::ethan-s3-apne1-tfstate/*",
08:32:44.527 STDOUT [backend] terraform:                         ]
08:32:44.527 STDOUT [backend] terraform:                     },
08:32:44.527 STDOUT [backend] terraform:                   + {
08:32:44.527 STDOUT [backend] terraform:                       + Action    = "s3:*"
08:32:44.527 STDOUT [backend] terraform:                       + Condition = {
08:32:44.527 STDOUT [backend] terraform:                           + NumericLessThan = {
08:32:44.527 STDOUT [backend] terraform:                               + "s3:TlsVersion" = "1.2"
08:32:44.527 STDOUT [backend] terraform:                             }
08:32:44.527 STDOUT [backend] terraform:                         }
08:32:44.527 STDOUT [backend] terraform:                       + Effect    = "Deny"
08:32:44.528 STDOUT [backend] terraform:                       + Principal = "*"
08:32:44.528 STDOUT [backend] terraform:                       + Resource  = [
08:32:44.528 STDOUT [backend] terraform:                           + "arn:aws:s3:::ethan-s3-apne1-tfstate",
08:32:44.528 STDOUT [backend] terraform:                           + "arn:aws:s3:::ethan-s3-apne1-tfstate/*",
08:32:44.528 STDOUT [backend] terraform:                         ]
08:32:44.528 STDOUT [backend] terraform:                       + Sid       = "EnforceTLSv12orHigher"
08:32:44.528 STDOUT [backend] terraform:                     },
08:32:44.528 STDOUT [backend] terraform:                   + {
08:32:44.528 STDOUT [backend] terraform:                       + Action    = "s3:*"
08:32:44.528 STDOUT [backend] terraform:                       + Condition = {
08:32:44.528 STDOUT [backend] terraform:                           + Bool = {
08:32:44.528 STDOUT [backend] terraform:                               + "aws:SecureTransport" = "false"
08:32:44.528 STDOUT [backend] terraform:                             }
08:32:44.528 STDOUT [backend] terraform:                         }
08:32:44.528 STDOUT [backend] terraform:                       + Effect    = "Deny"
08:32:44.528 STDOUT [backend] terraform:                       + Principal = "*"
08:32:44.528 STDOUT [backend] terraform:                       + Resource  = [
08:32:44.528 STDOUT [backend] terraform:                           + "arn:aws:s3:::ethan-s3-apne1-tfstate",
08:32:44.528 STDOUT [backend] terraform:                           + "arn:aws:s3:::ethan-s3-apne1-tfstate/*",
08:32:44.529 STDOUT [backend] terraform:                         ]
08:32:44.529 STDOUT [backend] terraform:                       + Sid       = "AllowSSLRequestsOnly"
08:32:44.529 STDOUT [backend] terraform:                     },
08:32:44.529 STDOUT [backend] terraform:                 ]
08:32:44.529 STDOUT [backend] terraform:               + Version   = "2012-10-17"
08:32:44.529 STDOUT [backend] terraform:             }
08:32:44.529 STDOUT [backend] terraform:         )
08:32:44.529 STDOUT [backend] terraform:       + region = "ap-northeast-1"
08:32:44.529 STDOUT [backend] terraform:     }
08:32:44.529 STDOUT [backend] terraform:   # module.backend.aws_s3_bucket_public_access_block.this will be created
08:32:44.529 STDOUT [backend] terraform:   + resource "aws_s3_bucket_public_access_block" "this" {
08:32:44.529 STDOUT [backend] terraform:       + block_public_acls       = true
08:32:44.529 STDOUT [backend] terraform:       + block_public_policy     = true
08:32:44.529 STDOUT [backend] terraform:       + bucket                  = "ethan-s3-apne1-tfstate"
08:32:44.529 STDOUT [backend] terraform:       + id                      = (known after apply)
08:32:44.529 STDOUT [backend] terraform:       + ignore_public_acls      = true
08:32:44.529 STDOUT [backend] terraform:       + region                  = "ap-northeast-1"
08:32:44.529 STDOUT [backend] terraform:       + restrict_public_buckets = true
08:32:44.529 STDOUT [backend] terraform:     }
08:32:44.529 STDOUT [backend] terraform:   # module.backend.aws_s3_bucket_versioning.this will be created
08:32:44.529 STDOUT [backend] terraform:   + resource "aws_s3_bucket_versioning" "this" {
08:32:44.530 STDOUT [backend] terraform:       + bucket = "ethan-s3-apne1-tfstate"
08:32:44.530 STDOUT [backend] terraform:       + id     = (known after apply)
08:32:44.530 STDOUT [backend] terraform:       + region = "ap-northeast-1"
08:32:44.530 STDOUT [backend] terraform:       + versioning_configuration {
08:32:44.530 STDOUT [backend] terraform:           + mfa_delete = (known after apply)
08:32:44.530 STDOUT [backend] terraform:           + status     = "Enabled"
08:32:44.530 STDOUT [backend] terraform:         }
08:32:44.530 STDOUT [backend] terraform:     }
08:32:44.530 STDOUT [backend] terraform: Plan: 3 to add, 0 to change, 0 to destroy.
08:32:44.530 STDOUT [backend] terraform: 
08:32:44.543 INFO   [dns] Downloading Terraform configurations from ../../../.. into ./dns/.terragrunt-cache/5ZjuMepC-GURAb0rhJZm1Hjryhg/vxdbUoFBPPcfo8ey7QUdnvPtOeY
08:32:45.155 INFO   [dns] terraform: Initializing the backend...
08:32:46.401 INFO   [dns] terraform: 
08:32:46.401 INFO   [dns] terraform: Successfully configured the backend "s3"! Terraform will automatically
08:32:46.401 INFO   [dns] terraform: use this backend unless the backend configuration changes.
08:32:46.688 INFO   [dns] terraform: Initializing modules...
08:32:46.689 INFO   [dns] terraform: - dns in ../../../modules/aws/dns
08:32:46.690 INFO   [dns] terraform: Initializing provider plugins...
08:32:46.690 INFO   [dns] terraform: - Finding hashicorp/aws versions matching "~> 6.0.0"...
08:32:46.893 INFO   [dns] terraform: - Finding hashicorp/http versions matching "~> 3.5.0"...
08:32:46.933 INFO   [dns] terraform: - Finding hashicorp/random versions matching "~> 3.7.2"...
08:32:47.198 INFO   [dns] terraform: - Installing hashicorp/http v3.5.0...
08:32:47.485 INFO   [dns] terraform: - Installed hashicorp/http v3.5.0 (signed by HashiCorp)
08:32:47.654 INFO   [dns] terraform: - Installing hashicorp/random v3.7.2...
08:32:47.925 INFO   [dns] terraform: - Installed hashicorp/random v3.7.2 (signed by HashiCorp)
08:32:48.079 INFO   [dns] terraform: - Installing hashicorp/aws v6.0.0...
08:32:52.860 INFO   [dns] terraform: - Installed hashicorp/aws v6.0.0 (signed by HashiCorp)
08:32:52.860 INFO   [dns] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
08:32:52.860 INFO   [dns] terraform: selections it made above. Include this file in your version control repository
08:32:52.860 INFO   [dns] terraform: so that Terraform can guarantee to make the same selections by default when
08:32:52.861 INFO   [dns] terraform: you run "terraform init" in the future.
08:32:52.861 INFO   [dns] terraform: Terraform has been successfully initialized!
08:32:52.864 INFO   [dns] Executing hook: fmt
08:32:52.885 INFO   [dns] Executing hook: validate
Success! The configuration is valid.

08:32:59.158 STDOUT [dns] terraform: Terraform used the selected providers to generate the following execution
08:32:59.158 STDOUT [dns] terraform: plan. Resource actions are indicated with the following symbols:
08:32:59.158 STDOUT [dns] terraform:   + create
08:32:59.158 STDOUT [dns] terraform:  %3C= read (data resources)
08:32:59.158 STDOUT [dns] terraform: Terraform will perform the following actions:
08:32:59.158 STDOUT [dns] terraform:   # module.dns.data.aws_iam_policy_document.route53_query will be read during apply
08:32:59.158 STDOUT [dns] terraform:   # (config refers to values not yet known)
08:32:59.158 STDOUT [dns] terraform:  %3C= data "aws_iam_policy_document" "route53_query" {
08:32:59.158 STDOUT [dns] terraform:       + id            = (known after apply)
08:32:59.159 STDOUT [dns] terraform:       + json          = (known after apply)
08:32:59.159 STDOUT [dns] terraform:       + minified_json = (known after apply)
08:32:59.159 STDOUT [dns] terraform:       + statement {
08:32:59.159 STDOUT [dns] terraform:           + actions   = [
08:32:59.159 STDOUT [dns] terraform:               + "logs:CreateLogStream",
08:32:59.159 STDOUT [dns] terraform:               + "logs:PutLogEvents",
08:32:59.159 STDOUT [dns] terraform:             ]
08:32:59.159 STDOUT [dns] terraform:           + resources = [
08:32:59.159 STDOUT [dns] terraform:               + (known after apply),
08:32:59.159 STDOUT [dns] terraform:             ]
08:32:59.159 STDOUT [dns] terraform:           + principals {
08:32:59.159 STDOUT [dns] terraform:               + identifiers = [
08:32:59.159 STDOUT [dns] terraform:                   + "route53.amazonaws.com",
08:32:59.159 STDOUT [dns] terraform:                 ]
08:32:59.159 STDOUT [dns] terraform:               + type        = "Service"
08:32:59.159 STDOUT [dns] terraform:             }
08:32:59.159 STDOUT [dns] terraform:         }
08:32:59.159 STDOUT [dns] terraform:     }
08:32:59.159 STDOUT [dns] terraform:   # module.dns.aws_acm_certificate.cert will be created
08:32:59.160 STDOUT [dns] terraform:   + resource "aws_acm_certificate" "cert" {
08:32:59.160 STDOUT [dns] terraform:       + arn                       = (known after apply)
08:32:59.160 STDOUT [dns] terraform:       + domain_name               = "ethan-example.com"
08:32:59.160 STDOUT [dns] terraform:       + domain_validation_options = [
08:32:59.160 STDOUT [dns] terraform:           + {
08:32:59.160 STDOUT [dns] terraform:               + domain_name           = "ethan-example.com"
08:32:59.160 STDOUT [dns] terraform:               + resource_record_name  = (known after apply)
08:32:59.160 STDOUT [dns] terraform:               + resource_record_type  = (known after apply)
08:32:59.160 STDOUT [dns] terraform:               + resource_record_value = (known after apply)
08:32:59.160 STDOUT [dns] terraform:             },
08:32:59.160 STDOUT [dns] terraform:         ]
08:32:59.160 STDOUT [dns] terraform:       + id                        = (known after apply)
08:32:59.160 STDOUT [dns] terraform:       + key_algorithm             = (known after apply)
08:32:59.160 STDOUT [dns] terraform:       + not_after                 = (known after apply)
08:32:59.160 STDOUT [dns] terraform:       + not_before                = (known after apply)
08:32:59.160 STDOUT [dns] terraform:       + pending_renewal           = (known after apply)
08:32:59.160 STDOUT [dns] terraform:       + region                    = "ap-northeast-1"
08:32:59.161 STDOUT [dns] terraform:       + renewal_eligibility       = (known after apply)
08:32:59.161 STDOUT [dns] terraform:       + renewal_summary           = (known after apply)
08:32:59.161 STDOUT [dns] terraform:       + status                    = (known after apply)
08:32:59.161 STDOUT [dns] terraform:       + subject_alternative_names = [
08:32:59.161 STDOUT [dns] terraform:           + "ethan-example.com",
08:32:59.161 STDOUT [dns] terraform:         ]
08:32:59.161 STDOUT [dns] terraform:       + tags                      = {
08:32:59.161 STDOUT [dns] terraform:           + "Name" = "ethan-dev-acm-apne1-cert"
08:32:59.161 STDOUT [dns] terraform:         }
08:32:59.161 STDOUT [dns] terraform:       + tags_all                  = {
08:32:59.161 STDOUT [dns] terraform:           + "Name" = "ethan-dev-acm-apne1-cert"
08:32:59.161 STDOUT [dns] terraform:         }
08:32:59.161 STDOUT [dns] terraform:       + type                      = (known after apply)
08:32:59.161 STDOUT [dns] terraform:       + validation_emails         = (known after apply)
08:32:59.161 STDOUT [dns] terraform:       + validation_method         = "DNS"
08:32:59.161 STDOUT [dns] terraform:       + options (known after apply)
08:32:59.161 STDOUT [dns] terraform:     }
08:32:59.161 STDOUT [dns] terraform:   # module.dns.aws_cloudwatch_log_group.route53_query will be created
08:32:59.161 STDOUT [dns] terraform:   + resource "aws_cloudwatch_log_group" "route53_query" {
08:32:59.161 STDOUT [dns] terraform:       + arn               = (known after apply)
08:32:59.161 STDOUT [dns] terraform:       + id                = (known after apply)
08:32:59.162 STDOUT [dns] terraform:       + log_group_class   = (known after apply)
08:32:59.162 STDOUT [dns] terraform:       + name              = "/aws/route53/query"
08:32:59.162 STDOUT [dns] terraform:       + name_prefix       = (known after apply)
08:32:59.162 STDOUT [dns] terraform:       + region            = "ap-northeast-1"
08:32:59.162 STDOUT [dns] terraform:       + retention_in_days = 30
08:32:59.162 STDOUT [dns] terraform:       + skip_destroy      = false
08:32:59.162 STDOUT [dns] terraform:       + tags_all          = (known after apply)
08:32:59.162 STDOUT [dns] terraform:     }
08:32:59.162 STDOUT [dns] terraform:   # module.dns.aws_cloudwatch_log_resource_policy.route53_query will be created
08:32:59.162 STDOUT [dns] terraform:   + resource "aws_cloudwatch_log_resource_policy" "route53_query" {
08:32:59.162 STDOUT [dns] terraform:       + id              = (known after apply)
08:32:59.162 STDOUT [dns] terraform:       + policy_document = (known after apply)
08:32:59.162 STDOUT [dns] terraform:       + policy_name     = "ethan-dev-route53-query"
08:32:59.162 STDOUT [dns] terraform:       + region          = "ap-northeast-1"
08:32:59.162 STDOUT [dns] terraform:     }
08:32:59.162 STDOUT [dns] terraform:   # module.dns.aws_route53_query_log.route53_query will be created
08:32:59.162 STDOUT [dns] terraform:   + resource "aws_route53_query_log" "route53_query" {
08:32:59.162 STDOUT [dns] terraform:       + arn                      = (known after apply)
08:32:59.162 STDOUT [dns] terraform:       + cloudwatch_log_group_arn = (known after apply)
08:32:59.162 STDOUT [dns] terraform:       + id                       = (known after apply)
08:32:59.163 STDOUT [dns] terraform:       + zone_id                  = (known after apply)
08:32:59.163 STDOUT [dns] terraform:     }
08:32:59.163 STDOUT [dns] terraform:   # module.dns.aws_route53_record.cert_validation["ethan-example.com"] will be created
08:32:59.163 STDOUT [dns] terraform:   + resource "aws_route53_record" "cert_validation" {
08:32:59.163 STDOUT [dns] terraform:       + allow_overwrite = true
08:32:59.163 STDOUT [dns] terraform:       + fqdn            = (known after apply)
08:32:59.163 STDOUT [dns] terraform:       + id              = (known after apply)
08:32:59.163 STDOUT [dns] terraform:       + name            = (known after apply)
08:32:59.163 STDOUT [dns] terraform:       + records         = (known after apply)
08:32:59.163 STDOUT [dns] terraform:       + ttl             = 60
08:32:59.163 STDOUT [dns] terraform:       + type            = (known after apply)
08:32:59.163 STDOUT [dns] terraform:       + zone_id         = (known after apply)
08:32:59.164 STDOUT [dns] terraform:     }
08:32:59.164 STDOUT [dns] terraform:   # module.dns.aws_route53_zone.openmetadata_zone will be created
08:32:59.164 STDOUT [dns] terraform:   + resource "aws_route53_zone" "openmetadata_zone" {
08:32:59.164 STDOUT [dns] terraform:       + arn                 = (known after apply)
08:32:59.165 STDOUT [dns] terraform:       + comment             = "Managed by Terraform"
08:32:59.165 STDOUT [dns] terraform:       + force_destroy       = false
08:32:59.165 STDOUT [dns] terraform:       + id                  = (known after apply)
08:32:59.165 STDOUT [dns] terraform:       + name                = "ethan-example.com"
08:32:59.165 STDOUT [dns] terraform:       + name_servers        = (known after apply)
08:32:59.166 STDOUT [dns] terraform:       + primary_name_server = (known after apply)
08:32:59.166 STDOUT [dns] terraform:       + tags                = {
08:32:59.166 STDOUT [dns] terraform:           + "Name" = "ethan-dev-dns-apne1-openmetadata"
08:32:59.166 STDOUT [dns] terraform:         }
08:32:59.166 STDOUT [dns] terraform:       + tags_all            = {
08:32:59.167 STDOUT [dns] terraform:           + "Name" = "ethan-dev-dns-apne1-openmetadata"
08:32:59.167 STDOUT [dns] terraform:         }
08:32:59.167 STDOUT [dns] terraform:       + zone_id             = (known after apply)
08:32:59.167 STDOUT [dns] terraform:     }
08:32:59.167 STDOUT [dns] terraform: Plan: 6 to add, 0 to change, 0 to destroy.
08:32:59.167 STDOUT [dns] terraform: 
08:32:59.167 STDOUT [dns] terraform: Changes to Outputs:
08:32:59.167 STDOUT [dns] terraform:   + cert_arn             = (known after apply)
08:32:59.168 STDOUT [dns] terraform:   + domain_name          = "ethan-example.com"
08:32:59.168 STDOUT [dns] terraform:   + openmetadata_zone_id = (known after apply)
08:33:01.098 WARN   [aws] Config ./dns/terragrunt.hcl is a dependency of ./aws/terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
08:33:01.103 INFO   [aws] Downloading Terraform configurations from ../../../.. into ./aws/.terragrunt-cache/Gkf-XB9erf0W2gWI9HQKwo4xkmE/vxdbUoFBPPcfo8ey7QUdnvPtOeY
08:33:01.756 INFO   [aws] terraform: Initializing the backend...
08:33:02.963 INFO   [aws] terraform: 
08:33:02.963 INFO   [aws] terraform: Successfully configured the backend "s3"! Terraform will automatically
08:33:02.963 INFO   [aws] terraform: use this backend unless the backend configuration changes.
08:33:03.297 INFO   [aws] terraform: Initializing modules...
08:33:03.302 INFO   [aws] terraform: - network in ../../../modules/aws/network
08:33:03.303 INFO   [aws] terraform: - openmetadata_aurora in ../../../modules/aws/openmetadata/aurora
08:33:03.304 INFO   [aws] terraform: - openmetadata_cloudwatch in ../../../modules/aws/openmetadata/cloudwatch
08:33:03.305 INFO   [aws] terraform: - openmetadata_ecr in ../../../modules/aws/openmetadata/ecr
08:33:03.306 INFO   [aws] terraform: - openmetadata_ecs in ../../../modules/aws/openmetadata/ecs
08:33:03.307 INFO   [aws] terraform: - openmetadata_iam in ../../../modules/aws/openmetadata/iam
08:33:03.307 INFO   [aws] terraform: - openmetadata_kms_key in ../../../modules/aws/openmetadata/kms_key
08:33:03.308 INFO   [aws] terraform: - openmetadata_lb in ../../../modules/aws/openmetadata/load_balancer
08:33:03.309 INFO   [aws] terraform: - openmetadata_s3 in ../../../modules/aws/openmetadata/s3
08:33:03.310 INFO   [aws] terraform: - openmetadata_secretmanager in ../../../modules/aws/openmetadata/secrets_manager
08:33:03.310 INFO   [aws] terraform: - openmetadata_security_group in ../../../modules/aws/openmetadata/security_group
08:33:03.313 INFO   [aws] terraform: Initializing provider plugins...
08:33:03.313 INFO   [aws] terraform: - terraform.io/builtin/terraform is built in to Terraform
08:33:03.313 INFO   [aws] terraform: - Finding hashicorp/http versions matching "~> 3.5.0"...
08:33:03.481 INFO   [aws] terraform: - Finding hashicorp/random versions matching "~> 3.7.2"...
08:33:03.523 INFO   [aws] terraform: - Finding hashicorp/aws versions matching "~> 6.0.0"...
08:33:03.567 INFO   [aws] terraform: - Finding latest version of hashicorp/archive...
08:33:03.731 INFO   [aws] terraform: - Installing hashicorp/http v3.5.0...
08:33:04.021 INFO   [aws] terraform: - Installed hashicorp/http v3.5.0 (signed by HashiCorp)
08:33:04.162 INFO   [aws] terraform: - Installing hashicorp/random v3.7.2...
08:33:04.441 INFO   [aws] terraform: - Installed hashicorp/random v3.7.2 (signed by HashiCorp)
08:33:04.615 INFO   [aws] terraform: - Installing hashicorp/aws v6.0.0...
08:33:10.064 INFO   [aws] terraform: - Installed hashicorp/aws v6.0.0 (signed by HashiCorp)
08:33:10.204 INFO   [aws] terraform: - Installing hashicorp/archive v2.7.1...
08:33:10.458 INFO   [aws] terraform: - Installed hashicorp/archive v2.7.1 (signed by HashiCorp)
08:33:10.458 INFO   [aws] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
08:33:10.459 INFO   [aws] terraform: selections it made above. Include this file in your version control repository
08:33:10.459 INFO   [aws] terraform: so that Terraform can guarantee to make the same selections by default when
08:33:10.459 INFO   [aws] terraform: you run "terraform init" in the future.
08:33:10.459 INFO   [aws] terraform: Terraform has been successfully initialized!
08:33:10.462 INFO   [aws] Executing hook: fmt
08:33:10.488 INFO   [aws] Executing hook: validate
Success! The configuration is valid.

08:33:16.430 STDOUT [aws] terraform: module.openmetadata_ecr.data.archive_file.elasticsearch: Reading...
08:33:16.438 STDOUT [aws] terraform: module.openmetadata_ecr.data.archive_file.openmetadata: Reading...
08:33:16.440 STDOUT [aws] terraform: module.openmetadata_ecr.data.archive_file.ingestion: Reading...
08:33:16.458 STDOUT [aws] terraform: module.openmetadata_ecr.data.archive_file.elasticsearch: Read complete after 0s [id=f62ce6c9a0b28ae85ca6036530a83322a521e75a]
08:33:16.503 STDOUT [aws] terraform: module.openmetadata_ecr.data.archive_file.ingestion: Read complete after 1s [id=953300813302d3d51dc4e2d89abdacc73c5bc2d8]
08:33:16.506 STDOUT [aws] terraform: module.openmetadata_ecr.data.archive_file.openmetadata: Read complete after 1s [id=e3dad56dcd742d40c50096c7078b7867f2903cdb]
08:33:17.076 STDOUT [aws] terraform: module.openmetadata_iam.data.aws_region.current: Reading...
08:33:17.080 STDOUT [aws] terraform: module.openmetadata_iam.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
08:33:17.082 STDOUT [aws] terraform: module.openmetadata_iam.data.aws_caller_identity.current: Reading...
08:33:17.085 STDOUT [aws] terraform: module.openmetadata_ecs.data.aws_caller_identity.current: Reading...
08:33:17.085 STDOUT [aws] terraform: module.openmetadata_ecr.data.aws_caller_identity.current: Reading...
08:33:17.092 STDOUT [aws] terraform: module.openmetadata_ecr.data.aws_region.current: Reading...
08:33:17.095 STDOUT [aws] terraform: module.openmetadata_ecr.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
08:33:17.220 STDOUT [aws] terraform: module.openmetadata_iam.data.aws_caller_identity.current: Read complete after 0s [id=921407950230]
08:33:17.356 STDOUT [aws] terraform: module.openmetadata_ecr.data.aws_caller_identity.current: Read complete after 0s [id=921407950230]
08:33:17.493 STDOUT [aws] terraform: module.openmetadata_ecs.data.aws_caller_identity.current: Read complete after 0s [id=921407950230]
08:33:17.708 STDOUT [aws] terraform: Terraform used the selected providers to generate the following execution
08:33:17.709 STDOUT [aws] terraform: plan. Resource actions are indicated with the following symbols:
08:33:17.709 STDOUT [aws] terraform:   + create
08:33:17.709 STDOUT [aws] terraform: Terraform will perform the following actions:
08:33:17.709 STDOUT [aws] terraform:   # module.network.aws_default_network_acl.default will be created
08:33:17.709 STDOUT [aws] terraform:   + resource "aws_default_network_acl" "default" {
08:33:17.709 STDOUT [aws] terraform:       + arn                    = (known after apply)
08:33:17.709 STDOUT [aws] terraform:       + default_network_acl_id = (known after apply)
08:33:17.709 STDOUT [aws] terraform:       + id                     = (known after apply)
08:33:17.709 STDOUT [aws] terraform:       + owner_id               = (known after apply)
08:33:17.709 STDOUT [aws] terraform:       + region                 = "ap-northeast-1"
08:33:17.709 STDOUT [aws] terraform:       + subnet_ids             = (known after apply)
08:33:17.709 STDOUT [aws] terraform:       + tags                   = {
08:33:17.709 STDOUT [aws] terraform:           + "Name" = "ethan-dev-nacl-default"
08:33:17.709 STDOUT [aws] terraform:         }
08:33:17.709 STDOUT [aws] terraform:       + tags_all               = {
08:33:17.709 STDOUT [aws] terraform:           + "Name" = "ethan-dev-nacl-default"
08:33:17.709 STDOUT [aws] terraform:         }
08:33:17.709 STDOUT [aws] terraform:       + vpc_id                 = (known after apply)
08:33:17.710 STDOUT [aws] terraform:       + egress {
08:33:17.710 STDOUT [aws] terraform:           + action          = "allow"
08:33:17.710 STDOUT [aws] terraform:           + cidr_block      = "0.0.0.0/0"
08:33:17.710 STDOUT [aws] terraform:           + from_port       = 0
08:33:17.710 STDOUT [aws] terraform:           + icmp_code       = 0
08:33:17.710 STDOUT [aws] terraform:           + icmp_type       = 0
08:33:17.710 STDOUT [aws] terraform:           + protocol        = "-1"
08:33:17.710 STDOUT [aws] terraform:           + rule_no         = 100
08:33:17.710 STDOUT [aws] terraform:           + to_port         = 0
08:33:17.710 STDOUT [aws] terraform:             # (1 unchanged attribute hidden)
08:33:17.710 STDOUT [aws] terraform:         }
08:33:17.710 STDOUT [aws] terraform:       + ingress {
08:33:17.710 STDOUT [aws] terraform:           + action          = "allow"
08:33:17.710 STDOUT [aws] terraform:           + cidr_block      = "0.0.0.0/0"
08:33:17.710 STDOUT [aws] terraform:           + from_port       = 0
08:33:17.710 STDOUT [aws] terraform:           + icmp_code       = 0
08:33:17.710 STDOUT [aws] terraform:           + icmp_type       = 0
08:33:17.710 STDOUT [aws] terraform:           + protocol        = "-1"
08:33:17.710 STDOUT [aws] terraform:           + rule_no         = 100
08:33:17.710 STDOUT [aws] terraform:           + to_port         = 0
08:33:17.710 STDOUT [aws] terraform:             # (1 unchanged attribute hidden)
08:33:17.710 STDOUT [aws] terraform:         }
08:33:17.711 STDOUT [aws] terraform:     }
08:33:17.711 STDOUT [aws] terraform:   # module.network.aws_default_route_table.default will be created
08:33:17.711 STDOUT [aws] terraform:   + resource "aws_default_route_table" "default" {
08:33:17.711 STDOUT [aws] terraform:       + arn                    = (known after apply)
08:33:17.711 STDOUT [aws] terraform:       + default_route_table_id = (known after apply)
08:33:17.711 STDOUT [aws] terraform:       + id                     = (known after apply)
08:33:17.711 STDOUT [aws] terraform:       + owner_id               = (known after apply)
08:33:17.711 STDOUT [aws] terraform:       + region                 = "ap-northeast-1"
08:33:17.711 STDOUT [aws] terraform:       + route                  = (known after apply)
08:33:17.711 STDOUT [aws] terraform:       + tags_all               = (known after apply)
08:33:17.711 STDOUT [aws] terraform:       + vpc_id                 = (known after apply)
08:33:17.711 STDOUT [aws] terraform:     }
08:33:17.711 STDOUT [aws] terraform:   # module.network.aws_default_security_group.sg_default will be created
08:33:17.711 STDOUT [aws] terraform:   + resource "aws_default_security_group" "sg_default" {
08:33:17.711 STDOUT [aws] terraform:       + arn                    = (known after apply)
08:33:17.711 STDOUT [aws] terraform:       + description            = (known after apply)
08:33:17.711 STDOUT [aws] terraform:       + egress                 = (known after apply)
08:33:17.711 STDOUT [aws] terraform:       + id                     = (known after apply)
08:33:17.712 STDOUT [aws] terraform:       + ingress                = (known after apply)
08:33:17.712 STDOUT [aws] terraform:       + name                   = (known after apply)
08:33:17.712 STDOUT [aws] terraform:       + name_prefix            = (known after apply)
08:33:17.712 STDOUT [aws] terraform:       + owner_id               = (known after apply)
08:33:17.712 STDOUT [aws] terraform:       + region                 = "ap-northeast-1"
08:33:17.712 STDOUT [aws] terraform:       + revoke_rules_on_delete = false
08:33:17.712 STDOUT [aws] terraform:       + tags                   = {
08:33:17.712 STDOUT [aws] terraform:           + "Name" = "ethan-dev-sg-default"
08:33:17.712 STDOUT [aws] terraform:         }
08:33:17.712 STDOUT [aws] terraform:       + tags_all               = {
08:33:17.712 STDOUT [aws] terraform:           + "Name" = "ethan-dev-sg-default"
08:33:17.712 STDOUT [aws] terraform:         }
08:33:17.712 STDOUT [aws] terraform:       + vpc_id                 = (known after apply)
08:33:17.712 STDOUT [aws] terraform:     }
08:33:17.712 STDOUT [aws] terraform:   # module.network.aws_eip.nat_a will be created
08:33:17.712 STDOUT [aws] terraform:   + resource "aws_eip" "nat_a" {
08:33:17.712 STDOUT [aws] terraform:       + allocation_id        = (known after apply)
08:33:17.712 STDOUT [aws] terraform:       + arn                  = (known after apply)
08:33:17.712 STDOUT [aws] terraform:       + association_id       = (known after apply)
08:33:17.712 STDOUT [aws] terraform:       + carrier_ip           = (known after apply)
08:33:17.713 STDOUT [aws] terraform:       + customer_owned_ip    = (known after apply)
08:33:17.713 STDOUT [aws] terraform:       + domain               = "vpc"
08:33:17.713 STDOUT [aws] terraform:       + id                   = (known after apply)
08:33:17.713 STDOUT [aws] terraform:       + instance             = (known after apply)
08:33:17.713 STDOUT [aws] terraform:       + ipam_pool_id         = (known after apply)
08:33:17.713 STDOUT [aws] terraform:       + network_border_group = (known after apply)
08:33:17.713 STDOUT [aws] terraform:       + network_interface    = (known after apply)
08:33:17.713 STDOUT [aws] terraform:       + private_dns          = (known after apply)
08:33:17.713 STDOUT [aws] terraform:       + private_ip           = (known after apply)
08:33:17.713 STDOUT [aws] terraform:       + ptr_record           = (known after apply)
08:33:17.713 STDOUT [aws] terraform:       + public_dns           = (known after apply)
08:33:17.713 STDOUT [aws] terraform:       + public_ip            = (known after apply)
08:33:17.713 STDOUT [aws] terraform:       + public_ipv4_pool     = (known after apply)
08:33:17.713 STDOUT [aws] terraform:       + region               = "ap-northeast-1"
08:33:17.713 STDOUT [aws] terraform:       + tags                 = {
08:33:17.713 STDOUT [aws] terraform:           + "Name" = "ethan-dev-eip-apne1-nat-a"
08:33:17.713 STDOUT [aws] terraform:         }
08:33:17.713 STDOUT [aws] terraform:       + tags_all             = {
08:33:17.714 STDOUT [aws] terraform:           + "Name" = "ethan-dev-eip-apne1-nat-a"
08:33:17.714 STDOUT [aws] terraform:         }
08:33:17.714 STDOUT [aws] terraform:     }
08:33:17.714 STDOUT [aws] terraform:   # module.network.aws_eip.nat_c will be created
08:33:17.714 STDOUT [aws] terraform:   + resource "aws_eip" "nat_c" {
08:33:17.714 STDOUT [aws] terraform:       + allocation_id        = (known after apply)
08:33:17.714 STDOUT [aws] terraform:       + arn                  = (known after apply)
08:33:17.714 STDOUT [aws] terraform:       + association_id       = (known after apply)
08:33:17.714 STDOUT [aws] terraform:       + carrier_ip           = (known after apply)
08:33:17.714 STDOUT [aws] terraform:       + customer_owned_ip    = (known after apply)
08:33:17.714 STDOUT [aws] terraform:       + domain               = "vpc"
08:33:17.714 STDOUT [aws] terraform:       + id                   = (known after apply)
08:33:17.714 STDOUT [aws] terraform:       + instance             = (known after apply)
08:33:17.714 STDOUT [aws] terraform:       + ipam_pool_id         = (known after apply)
08:33:17.714 STDOUT [aws] terraform:       + network_border_group = (known after apply)
08:33:17.714 STDOUT [aws] terraform:       + network_interface    = (known after apply)
08:33:17.714 STDOUT [aws] terraform:       + private_dns          = (known after apply)
08:33:17.714 STDOUT [aws] terraform:       + private_ip           = (known after apply)
08:33:17.714 STDOUT [aws] terraform:       + ptr_record           = (known after apply)
08:33:17.715 STDOUT [aws] terraform:       + public_dns           = (known after apply)
08:33:17.715 STDOUT [aws] terraform:       + public_ip            = (known after apply)
08:33:17.715 STDOUT [aws] terraform:       + public_ipv4_pool     = (known after apply)
08:33:17.715 STDOUT [aws] terraform:       + region               = "ap-northeast-1"
08:33:17.715 STDOUT [aws] terraform:       + tags                 = {
08:33:17.715 STDOUT [aws] terraform:           + "Name" = "ethan-dev-eip-apne1-nat-c"
08:33:17.715 STDOUT [aws] terraform:         }
08:33:17.715 STDOUT [aws] terraform:       + tags_all             = {
08:33:17.715 STDOUT [aws] terraform:           + "Name" = "ethan-dev-eip-apne1-nat-c"
08:33:17.715 STDOUT [aws] terraform:         }
08:33:17.715 STDOUT [aws] terraform:     }
08:33:17.715 STDOUT [aws] terraform:   # module.network.aws_internet_gateway.this will be created
08:33:17.715 STDOUT [aws] terraform:   + resource "aws_internet_gateway" "this" {
08:33:17.715 STDOUT [aws] terraform:       + arn      = (known after apply)
08:33:17.715 STDOUT [aws] terraform:       + id       = (known after apply)
08:33:17.715 STDOUT [aws] terraform:       + owner_id = (known after apply)
08:33:17.715 STDOUT [aws] terraform:       + region   = "ap-northeast-1"
08:33:17.715 STDOUT [aws] terraform:       + tags     = {
08:33:17.715 STDOUT [aws] terraform:           + "Name" = "ethan-dev-igw-apne1"
08:33:17.715 STDOUT [aws] terraform:         }
08:33:17.715 STDOUT [aws] terraform:       + tags_all = {
08:33:17.715 STDOUT [aws] terraform:           + "Name" = "ethan-dev-igw-apne1"
08:33:17.716 STDOUT [aws] terraform:         }
08:33:17.716 STDOUT [aws] terraform:       + vpc_id   = (known after apply)
08:33:17.716 STDOUT [aws] terraform:     }
08:33:17.716 STDOUT [aws] terraform:   # module.network.aws_nat_gateway.public_a will be created
08:33:17.716 STDOUT [aws] terraform:   + resource "aws_nat_gateway" "public_a" {
08:33:17.716 STDOUT [aws] terraform:       + allocation_id                      = (known after apply)
08:33:17.716 STDOUT [aws] terraform:       + association_id                     = (known after apply)
08:33:17.716 STDOUT [aws] terraform:       + connectivity_type                  = "public"
08:33:17.716 STDOUT [aws] terraform:       + id                                 = (known after apply)
08:33:17.716 STDOUT [aws] terraform:       + network_interface_id               = (known after apply)
08:33:17.716 STDOUT [aws] terraform:       + private_ip                         = (known after apply)
08:33:17.716 STDOUT [aws] terraform:       + public_ip                          = (known after apply)
08:33:17.716 STDOUT [aws] terraform:       + region                             = "ap-northeast-1"
08:33:17.716 STDOUT [aws] terraform:       + secondary_private_ip_address_count = (known after apply)
08:33:17.716 STDOUT [aws] terraform:       + secondary_private_ip_addresses     = (known after apply)
08:33:17.716 STDOUT [aws] terraform:       + subnet_id                          = (known after apply)
08:33:17.717 STDOUT [aws] terraform:       + tags                               = {
08:33:17.717 STDOUT [aws] terraform:           + "Name" = "ethan-dev-nat-apne1-public-a"
08:33:17.717 STDOUT [aws] terraform:         }
08:33:17.717 STDOUT [aws] terraform:       + tags_all                           = {
08:33:17.717 STDOUT [aws] terraform:           + "Name" = "ethan-dev-nat-apne1-public-a"
08:33:17.717 STDOUT [aws] terraform:         }
08:33:17.717 STDOUT [aws] terraform:     }
08:33:17.717 STDOUT [aws] terraform:   # module.network.aws_nat_gateway.public_c will be created
08:33:17.717 STDOUT [aws] terraform:   + resource "aws_nat_gateway" "public_c" {
08:33:17.717 STDOUT [aws] terraform:       + allocation_id                      = (known after apply)
08:33:17.717 STDOUT [aws] terraform:       + association_id                     = (known after apply)
08:33:17.717 STDOUT [aws] terraform:       + connectivity_type                  = "public"
08:33:17.717 STDOUT [aws] terraform:       + id                                 = (known after apply)
08:33:17.717 STDOUT [aws] terraform:       + network_interface_id               = (known after apply)
08:33:17.717 STDOUT [aws] terraform:       + private_ip                         = (known after apply)
08:33:17.717 STDOUT [aws] terraform:       + public_ip                          = (known after apply)
08:33:17.717 STDOUT [aws] terraform:       + region                             = "ap-northeast-1"
08:33:17.717 STDOUT [aws] terraform:       + secondary_private_ip_address_count = (known after apply)
08:33:17.718 STDOUT [aws] terraform:       + secondary_private_ip_addresses     = (known after apply)
08:33:17.718 STDOUT [aws] terraform:       + subnet_id                          = (known after apply)
08:33:17.718 STDOUT [aws] terraform:       + tags                               = {
08:33:17.718 STDOUT [aws] terraform:           + "Name" = "ethan-dev-nat-apne1-public-c"
08:33:17.718 STDOUT [aws] terraform:         }
08:33:17.718 STDOUT [aws] terraform:       + tags_all                           = {
08:33:17.718 STDOUT [aws] terraform:           + "Name" = "ethan-dev-nat-apne1-public-c"
08:33:17.718 STDOUT [aws] terraform:         }
08:33:17.718 STDOUT [aws] terraform:     }
08:33:17.718 STDOUT [aws] terraform:   # module.network.aws_route_table.private_a will be created
08:33:17.718 STDOUT [aws] terraform:   + resource "aws_route_table" "private_a" {
08:33:17.718 STDOUT [aws] terraform:       + arn              = (known after apply)
08:33:17.718 STDOUT [aws] terraform:       + id               = (known after apply)
08:33:17.718 STDOUT [aws] terraform:       + owner_id         = (known after apply)
08:33:17.718 STDOUT [aws] terraform:       + propagating_vgws = (known after apply)
08:33:17.718 STDOUT [aws] terraform:       + region           = "ap-northeast-1"
08:33:17.718 STDOUT [aws] terraform:       + route            = [
08:33:17.718 STDOUT [aws] terraform:           + {
08:33:17.719 STDOUT [aws] terraform:               + cidr_block                 = "0.0.0.0/0"
08:33:17.719 STDOUT [aws] terraform:               + nat_gateway_id             = (known after apply)
08:33:17.719 STDOUT [aws] terraform:                 # (11 unchanged attributes hidden)
08:33:17.719 STDOUT [aws] terraform:             },
08:33:17.719 STDOUT [aws] terraform:         ]
08:33:17.719 STDOUT [aws] terraform:       + tags             = {
08:33:17.719 STDOUT [aws] terraform:           + "Name" = "ethan-dev-rtb-apne1-private-a"
08:33:17.719 STDOUT [aws] terraform:         }
08:33:17.719 STDOUT [aws] terraform:       + tags_all         = {
08:33:17.719 STDOUT [aws] terraform:           + "Name" = "ethan-dev-rtb-apne1-private-a"
08:33:17.719 STDOUT [aws] terraform:         }
08:33:17.719 STDOUT [aws] terraform:       + vpc_id           = (known after apply)
08:33:17.719 STDOUT [aws] terraform:     }
08:33:17.719 STDOUT [aws] terraform:   # module.network.aws_route_table.private_c will be created
08:33:17.719 STDOUT [aws] terraform:   + resource "aws_route_table" "private_c" {
08:33:17.719 STDOUT [aws] terraform:       + arn              = (known after apply)
08:33:17.719 STDOUT [aws] terraform:       + id               = (known after apply)
08:33:17.719 STDOUT [aws] terraform:       + owner_id         = (known after apply)
08:33:17.719 STDOUT [aws] terraform:       + propagating_vgws = (known after apply)
08:33:17.719 STDOUT [aws] terraform:       + region           = "ap-northeast-1"
08:33:17.720 STDOUT [aws] terraform:       + route            = [
08:33:17.720 STDOUT [aws] terraform:           + {
08:33:17.720 STDOUT [aws] terraform:               + cidr_block                 = "0.0.0.0/0"
08:33:17.720 STDOUT [aws] terraform:               + nat_gateway_id             = (known after apply)
08:33:17.720 STDOUT [aws] terraform:                 # (11 unchanged attributes hidden)
08:33:17.720 STDOUT [aws] terraform:             },
08:33:17.720 STDOUT [aws] terraform:         ]
08:33:17.720 STDOUT [aws] terraform:       + tags             = {
08:33:17.720 STDOUT [aws] terraform:           + "Name" = "ethan-dev-rtb-apne1-private-c"
08:33:17.720 STDOUT [aws] terraform:         }
08:33:17.720 STDOUT [aws] terraform:       + tags_all         = {
08:33:17.720 STDOUT [aws] terraform:           + "Name" = "ethan-dev-rtb-apne1-private-c"
08:33:17.720 STDOUT [aws] terraform:         }
08:33:17.720 STDOUT [aws] terraform:       + vpc_id           = (known after apply)
08:33:17.720 STDOUT [aws] terraform:     }
08:33:17.720 STDOUT [aws] terraform:   # module.network.aws_route_table.public will be created
08:33:17.720 STDOUT [aws] terraform:   + resource "aws_route_table" "public" {
08:33:17.720 STDOUT [aws] terraform:       + arn              = (known after apply)
08:33:17.720 STDOUT [aws] terraform:       + id               = (known after apply)
08:33:17.720 STDOUT [aws] terraform:       + owner_id         = (known after apply)
08:33:17.721 STDOUT [aws] terraform:       + propagating_vgws = (known after apply)
08:33:17.721 STDOUT [aws] terraform:       + region           = "ap-northeast-1"
08:33:17.721 STDOUT [aws] terraform:       + route            = [
08:33:17.721 STDOUT [aws] terraform:           + {
08:33:17.721 STDOUT [aws] terraform:               + cidr_block                 = "0.0.0.0/0"
08:33:17.721 STDOUT [aws] terraform:               + gateway_id                 = (known after apply)
08:33:17.721 STDOUT [aws] terraform:                 # (11 unchanged attributes hidden)
08:33:17.721 STDOUT [aws] terraform:             },
08:33:17.721 STDOUT [aws] terraform:         ]
08:33:17.721 STDOUT [aws] terraform:       + tags             = {
08:33:17.721 STDOUT [aws] terraform:           + "Name" = "ethan-dev-rtb-apne1-public"
08:33:17.721 STDOUT [aws] terraform:         }
08:33:17.721 STDOUT [aws] terraform:       + tags_all         = {
08:33:17.721 STDOUT [aws] terraform:           + "Name" = "ethan-dev-rtb-apne1-public"
08:33:17.721 STDOUT [aws] terraform:         }
08:33:17.721 STDOUT [aws] terraform:       + vpc_id           = (known after apply)
08:33:17.721 STDOUT [aws] terraform:     }
08:33:17.721 STDOUT [aws] terraform:   # module.network.aws_route_table_association.private_a will be created
08:33:17.721 STDOUT [aws] terraform:   + resource "aws_route_table_association" "private_a" {
08:33:17.721 STDOUT [aws] terraform:       + id             = (known after apply)
08:33:17.722 STDOUT [aws] terraform:       + region         = "ap-northeast-1"
08:33:17.722 STDOUT [aws] terraform:       + route_table_id = (known after apply)
08:33:17.722 STDOUT [aws] terraform:       + subnet_id      = (known after apply)
08:33:17.722 STDOUT [aws] terraform:     }
08:33:17.722 STDOUT [aws] terraform:   # module.network.aws_route_table_association.private_c will be created
08:33:17.722 STDOUT [aws] terraform:   + resource "aws_route_table_association" "private_c" {
08:33:17.722 STDOUT [aws] terraform:       + id             = (known after apply)
08:33:17.722 STDOUT [aws] terraform:       + region         = "ap-northeast-1"
08:33:17.722 STDOUT [aws] terraform:       + route_table_id = (known after apply)
08:33:17.722 STDOUT [aws] terraform:       + subnet_id      = (known after apply)
08:33:17.722 STDOUT [aws] terraform:     }
08:33:17.722 STDOUT [aws] terraform:   # module.network.aws_route_table_association.public_a will be created
08:33:17.722 STDOUT [aws] terraform:   + resource "aws_route_table_association" "public_a" {
08:33:17.722 STDOUT [aws] terraform:       + id             = (known after apply)
08:33:17.722 STDOUT [aws] terraform:       + region         = "ap-northeast-1"
08:33:17.722 STDOUT [aws] terraform:       + route_table_id = (known after apply)
08:33:17.722 STDOUT [aws] terraform:       + subnet_id      = (known after apply)
08:33:17.722 STDOUT [aws] terraform:     }
08:33:17.723 STDOUT [aws] terraform:   # module.network.aws_route_table_association.public_c will be created
08:33:17.723 STDOUT [aws] terraform:   + resource "aws_route_table_association" "public_c" {
08:33:17.723 STDOUT [aws] terraform:       + id             = (known after apply)
08:33:17.723 STDOUT [aws] terraform:       + region         = "ap-northeast-1"
08:33:17.723 STDOUT [aws] terraform:       + route_table_id = (known after apply)
08:33:17.723 STDOUT [aws] terraform:       + subnet_id      = (known after apply)
08:33:17.723 STDOUT [aws] terraform:     }
08:33:17.723 STDOUT [aws] terraform:   # module.network.aws_security_group.self_reference will be created
08:33:17.723 STDOUT [aws] terraform:   + resource "aws_security_group" "self_reference" {
08:33:17.723 STDOUT [aws] terraform:       + arn                    = (known after apply)
08:33:17.723 STDOUT [aws] terraform:       + description            = "self-reference"
08:33:17.723 STDOUT [aws] terraform:       + egress                 = [
08:33:17.723 STDOUT [aws] terraform:           + {
08:33:17.723 STDOUT [aws] terraform:               + cidr_blocks      = [
08:33:17.723 STDOUT [aws] terraform:                   + "0.0.0.0/0",
08:33:17.723 STDOUT [aws] terraform:                 ]
08:33:17.724 STDOUT [aws] terraform:               + from_port        = 0
08:33:17.724 STDOUT [aws] terraform:               + ipv6_cidr_blocks = []
08:33:17.724 STDOUT [aws] terraform:               + prefix_list_ids  = []
08:33:17.724 STDOUT [aws] terraform:               + protocol         = "-1"
08:33:17.724 STDOUT [aws] terraform:               + security_groups  = []
08:33:17.724 STDOUT [aws] terraform:               + self             = false
08:33:17.724 STDOUT [aws] terraform:               + to_port          = 0
08:33:17.724 STDOUT [aws] terraform:                 # (1 unchanged attribute hidden)
08:33:17.724 STDOUT [aws] terraform:             },
08:33:17.724 STDOUT [aws] terraform:         ]
08:33:17.724 STDOUT [aws] terraform:       + id                     = (known after apply)
08:33:17.724 STDOUT [aws] terraform:       + ingress                = [
08:33:17.724 STDOUT [aws] terraform:           + {
08:33:17.724 STDOUT [aws] terraform:               + cidr_blocks      = []
08:33:17.724 STDOUT [aws] terraform:               + from_port        = 0
08:33:17.724 STDOUT [aws] terraform:               + ipv6_cidr_blocks = []
08:33:17.724 STDOUT [aws] terraform:               + prefix_list_ids  = []
08:33:17.724 STDOUT [aws] terraform:               + protocol         = "-1"
08:33:17.724 STDOUT [aws] terraform:               + security_groups  = []
08:33:17.724 STDOUT [aws] terraform:               + self             = true
08:33:17.725 STDOUT [aws] terraform:               + to_port          = 0
08:33:17.725 STDOUT [aws] terraform:                 # (1 unchanged attribute hidden)
08:33:17.725 STDOUT [aws] terraform:             },
08:33:17.725 STDOUT [aws] terraform:         ]
08:33:17.725 STDOUT [aws] terraform:       + name                   = "ethan-dev-sg-self-reference"
08:33:17.725 STDOUT [aws] terraform:       + name_prefix            = (known after apply)
08:33:17.725 STDOUT [aws] terraform:       + owner_id               = (known after apply)
08:33:17.725 STDOUT [aws] terraform:       + region                 = "ap-northeast-1"
08:33:17.725 STDOUT [aws] terraform:       + revoke_rules_on_delete = false
08:33:17.725 STDOUT [aws] terraform:       + tags                   = {
08:33:17.725 STDOUT [aws] terraform:           + "Name" = "ethan-dev-sg-self-reference"
08:33:17.725 STDOUT [aws] terraform:         }
08:33:17.725 STDOUT [aws] terraform:       + tags_all               = {
08:33:17.725 STDOUT [aws] terraform:           + "Name" = "ethan-dev-sg-self-reference"
08:33:17.725 STDOUT [aws] terraform:         }
08:33:17.725 STDOUT [aws] terraform:       + vpc_id                 = (known after apply)
08:33:17.725 STDOUT [aws] terraform:     }
08:33:17.725 STDOUT [aws] terraform:   # module.network.aws_subnet.private_a will be created
08:33:17.725 STDOUT [aws] terraform:   + resource "aws_subnet" "private_a" {
08:33:17.726 STDOUT [aws] terraform:       + arn                                            = (known after apply)
08:33:17.726 STDOUT [aws] terraform:       + assign_ipv6_address_on_creation                = false
08:33:17.726 STDOUT [aws] terraform:       + availability_zone                              = "ap-northeast-1a"
08:33:17.726 STDOUT [aws] terraform:       + availability_zone_id                           = (known after apply)
08:33:17.726 STDOUT [aws] terraform:       + cidr_block                                     = "10.0.10.0/24"
08:33:17.726 STDOUT [aws] terraform:       + enable_dns64                                   = false
08:33:17.726 STDOUT [aws] terraform:       + enable_resource_name_dns_a_record_on_launch    = false
08:33:17.726 STDOUT [aws] terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
08:33:17.726 STDOUT [aws] terraform:       + id                                             = (known after apply)
08:33:17.726 STDOUT [aws] terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
08:33:17.726 STDOUT [aws] terraform:       + ipv6_native                                    = false
08:33:17.726 STDOUT [aws] terraform:       + map_public_ip_on_launch                        = false
08:33:17.726 STDOUT [aws] terraform:       + owner_id                                       = (known after apply)
08:33:17.727 STDOUT [aws] terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
08:33:17.727 STDOUT [aws] terraform:       + region                                         = "ap-northeast-1"
08:33:17.727 STDOUT [aws] terraform:       + tags                                           = {
08:33:17.727 STDOUT [aws] terraform:           + "Name" = "ethan-dev-subnet-apne1-private-a"
08:33:17.727 STDOUT [aws] terraform:         }
08:33:17.727 STDOUT [aws] terraform:       + tags_all                                       = {
08:33:17.727 STDOUT [aws] terraform:           + "Name" = "ethan-dev-subnet-apne1-private-a"
08:33:17.727 STDOUT [aws] terraform:         }
08:33:17.727 STDOUT [aws] terraform:       + vpc_id                                         = (known after apply)
08:33:17.727 STDOUT [aws] terraform:     }
08:33:17.727 STDOUT [aws] terraform:   # module.network.aws_subnet.private_c will be created
08:33:17.727 STDOUT [aws] terraform:   + resource "aws_subnet" "private_c" {
08:33:17.727 STDOUT [aws] terraform:       + arn                                            = (known after apply)
08:33:17.727 STDOUT [aws] terraform:       + assign_ipv6_address_on_creation                = false
08:33:17.727 STDOUT [aws] terraform:       + availability_zone                              = "ap-northeast-1c"
08:33:17.727 STDOUT [aws] terraform:       + availability_zone_id                           = (known after apply)
08:33:17.727 STDOUT [aws] terraform:       + cidr_block                                     = "10.0.11.0/24"
08:33:17.728 STDOUT [aws] terraform:       + enable_dns64                                   = false
08:33:17.728 STDOUT [aws] terraform:       + enable_resource_name_dns_a_record_on_launch    = false
08:33:17.728 STDOUT [aws] terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
08:33:17.728 STDOUT [aws] terraform:       + id                                             = (known after apply)
08:33:17.728 STDOUT [aws] terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
08:33:17.728 STDOUT [aws] terraform:       + ipv6_native                                    = false
08:33:17.728 STDOUT [aws] terraform:       + map_public_ip_on_launch                        = false
08:33:17.728 STDOUT [aws] terraform:       + owner_id                                       = (known after apply)
08:33:17.728 STDOUT [aws] terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
08:33:17.728 STDOUT [aws] terraform:       + region                                         = "ap-northeast-1"
08:33:17.728 STDOUT [aws] terraform:       + tags                                           = {
08:33:17.728 STDOUT [aws] terraform:           + "Name" = "ethan-dev-subnet-apne1-private-c"
08:33:17.728 STDOUT [aws] terraform:         }
08:33:17.728 STDOUT [aws] terraform:       + tags_all                                       = {
08:33:17.729 STDOUT [aws] terraform:           + "Name" = "ethan-dev-subnet-apne1-private-c"
08:33:17.729 STDOUT [aws] terraform:         }
08:33:17.729 STDOUT [aws] terraform:       + vpc_id                                         = (known after apply)
08:33:17.729 STDOUT [aws] terraform:     }
08:33:17.729 STDOUT [aws] terraform:   # module.network.aws_subnet.public_a will be created
08:33:17.729 STDOUT [aws] terraform:   + resource "aws_subnet" "public_a" {
08:33:17.729 STDOUT [aws] terraform:       + arn                                            = (known after apply)
08:33:17.729 STDOUT [aws] terraform:       + assign_ipv6_address_on_creation                = false
08:33:17.729 STDOUT [aws] terraform:       + availability_zone                              = "ap-northeast-1a"
08:33:17.729 STDOUT [aws] terraform:       + availability_zone_id                           = (known after apply)
08:33:17.729 STDOUT [aws] terraform:       + cidr_block                                     = "10.0.0.0/24"
08:33:17.729 STDOUT [aws] terraform:       + enable_dns64                                   = false
08:33:17.729 STDOUT [aws] terraform:       + enable_resource_name_dns_a_record_on_launch    = false
08:33:17.729 STDOUT [aws] terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
08:33:17.729 STDOUT [aws] terraform:       + id                                             = (known after apply)
08:33:17.730 STDOUT [aws] terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
08:33:17.730 STDOUT [aws] terraform:       + ipv6_native                                    = false
08:33:17.730 STDOUT [aws] terraform:       + map_public_ip_on_launch                        = false
08:33:17.730 STDOUT [aws] terraform:       + owner_id                                       = (known after apply)
08:33:17.730 STDOUT [aws] terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
08:33:17.730 STDOUT [aws] terraform:       + region                                         = "ap-northeast-1"
08:33:17.730 STDOUT [aws] terraform:       + tags                                           = {
08:33:17.730 STDOUT [aws] terraform:           + "Name" = "ethan-dev-subnet-apne1-public-a"
08:33:17.730 STDOUT [aws] terraform:         }
08:33:17.730 STDOUT [aws] terraform:       + tags_all                                       = {
08:33:17.730 STDOUT [aws] terraform:           + "Name" = "ethan-dev-subnet-apne1-public-a"
08:33:17.730 STDOUT [aws] terraform:         }
08:33:17.730 STDOUT [aws] terraform:       + vpc_id                                         = (known after apply)
08:33:17.730 STDOUT [aws] terraform:     }
08:33:17.730 STDOUT [aws] terraform:   # module.network.aws_subnet.public_c will be created
08:33:17.731 STDOUT [aws] terraform:   + resource "aws_subnet" "public_c" {
08:33:17.731 STDOUT [aws] terraform:       + arn                                            = (known after apply)
08:33:17.731 STDOUT [aws] terraform:       + assign_ipv6_address_on_creation                = false
08:33:17.731 STDOUT [aws] terraform:       + availability_zone                              = "ap-northeast-1c"
08:33:17.731 STDOUT [aws] terraform:       + availability_zone_id                           = (known after apply)
08:33:17.731 STDOUT [aws] terraform:       + cidr_block                                     = "10.0.1.0/24"
08:33:17.731 STDOUT [aws] terraform:       + enable_dns64                                   = false
08:33:17.731 STDOUT [aws] terraform:       + enable_resource_name_dns_a_record_on_launch    = false
08:33:17.731 STDOUT [aws] terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
08:33:17.731 STDOUT [aws] terraform:       + id                                             = (known after apply)
08:33:17.731 STDOUT [aws] terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
08:33:17.731 STDOUT [aws] terraform:       + ipv6_native                                    = false
08:33:17.731 STDOUT [aws] terraform:       + map_public_ip_on_launch                        = false
08:33:17.731 STDOUT [aws] terraform:       + owner_id                                       = (known after apply)
08:33:17.732 STDOUT [aws] terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
08:33:17.732 STDOUT [aws] terraform:       + region                                         = "ap-northeast-1"
08:33:17.732 STDOUT [aws] terraform:       + tags                                           = {
08:33:17.732 STDOUT [aws] terraform:           + "Name" = "ethan-dev-subnet-apne1-public-c"
08:33:17.732 STDOUT [aws] terraform:         }
08:33:17.732 STDOUT [aws] terraform:       + tags_all                                       = {
08:33:17.732 STDOUT [aws] terraform:           + "Name" = "ethan-dev-subnet-apne1-public-c"
08:33:17.732 STDOUT [aws] terraform:         }
08:33:17.732 STDOUT [aws] terraform:       + vpc_id                                         = (known after apply)
08:33:17.732 STDOUT [aws] terraform:     }
08:33:17.732 STDOUT [aws] terraform:   # module.network.aws_vpc.this will be created
08:33:17.732 STDOUT [aws] terraform:   + resource "aws_vpc" "this" {
08:33:17.732 STDOUT [aws] terraform:       + arn                                  = (known after apply)
08:33:17.732 STDOUT [aws] terraform:       + cidr_block                           = "10.0.0.0/16"
08:33:17.732 STDOUT [aws] terraform:       + default_network_acl_id               = (known after apply)
08:33:17.732 STDOUT [aws] terraform:       + default_route_table_id               = (known after apply)
08:33:17.732 STDOUT [aws] terraform:       + default_security_group_id            = (known after apply)
08:33:17.733 STDOUT [aws] terraform:       + dhcp_options_id                      = (known after apply)
08:33:17.733 STDOUT [aws] terraform:       + enable_dns_hostnames                 = true
08:33:17.733 STDOUT [aws] terraform:       + enable_dns_support                   = true
08:33:17.733 STDOUT [aws] terraform:       + enable_network_address_usage_metrics = (known after apply)
08:33:17.733 STDOUT [aws] terraform:       + id                                   = (known after apply)
08:33:17.733 STDOUT [aws] terraform:       + instance_tenancy                     = "default"
08:33:17.733 STDOUT [aws] terraform:       + ipv6_association_id                  = (known after apply)
08:33:17.733 STDOUT [aws] terraform:       + ipv6_cidr_block                      = (known after apply)
08:33:17.733 STDOUT [aws] terraform:       + ipv6_cidr_block_network_border_group = (known after apply)
08:33:17.733 STDOUT [aws] terraform:       + main_route_table_id                  = (known after apply)
08:33:17.733 STDOUT [aws] terraform:       + owner_id                             = (known after apply)
08:33:17.734 STDOUT [aws] terraform:       + region                               = "ap-northeast-1"
08:33:17.734 STDOUT [aws] terraform:       + tags                                 = {
08:33:17.734 STDOUT [aws] terraform:           + "Name" = "ethan-dev-vpc-apne1"
08:33:17.734 STDOUT [aws] terraform:         }
08:33:17.734 STDOUT [aws] terraform:       + tags_all                             = {
08:33:17.734 STDOUT [aws] terraform:           + "Name" = "ethan-dev-vpc-apne1"
08:33:17.734 STDOUT [aws] terraform:         }
08:33:17.734 STDOUT [aws] terraform:     }
08:33:17.734 STDOUT [aws] terraform:   # module.network.aws_vpc_endpoint.s3 will be created
08:33:17.734 STDOUT [aws] terraform:   + resource "aws_vpc_endpoint" "s3" {
08:33:17.734 STDOUT [aws] terraform:       + arn                   = (known after apply)
08:33:17.734 STDOUT [aws] terraform:       + cidr_blocks           = (known after apply)
08:33:17.734 STDOUT [aws] terraform:       + dns_entry             = (known after apply)
08:33:17.734 STDOUT [aws] terraform:       + id                    = (known after apply)
08:33:17.735 STDOUT [aws] terraform:       + ip_address_type       = (known after apply)
08:33:17.735 STDOUT [aws] terraform:       + network_interface_ids = (known after apply)
08:33:17.735 STDOUT [aws] terraform:       + owner_id              = (known after apply)
08:33:17.735 STDOUT [aws] terraform:       + policy                = (known after apply)
08:33:17.735 STDOUT [aws] terraform:       + prefix_list_id        = (known after apply)
08:33:17.735 STDOUT [aws] terraform:       + private_dns_enabled   = (known after apply)
08:33:17.735 STDOUT [aws] terraform:       + region                = "ap-northeast-1"
08:33:17.735 STDOUT [aws] terraform:       + requester_managed     = (known after apply)
08:33:17.735 STDOUT [aws] terraform:       + route_table_ids       = (known after apply)
08:33:17.735 STDOUT [aws] terraform:       + security_group_ids    = (known after apply)
08:33:17.735 STDOUT [aws] terraform:       + service_name          = "com.amazonaws.ap-northeast-1.s3"
08:33:17.735 STDOUT [aws] terraform:       + service_region        = (known after apply)
08:33:17.735 STDOUT [aws] terraform:       + state                 = (known after apply)
08:33:17.735 STDOUT [aws] terraform:       + subnet_ids            = (known after apply)
08:33:17.735 STDOUT [aws] terraform:       + tags                  = {
08:33:17.735 STDOUT [aws] terraform:           + "Name" = "ethan-dev-vpce-apne1-s3"
08:33:17.735 STDOUT [aws] terraform:         }
08:33:17.735 STDOUT [aws] terraform:       + tags_all              = {
08:33:17.735 STDOUT [aws] terraform:           + "Name" = "ethan-dev-vpce-apne1-s3"
08:33:17.735 STDOUT [aws] terraform:         }
08:33:17.735 STDOUT [aws] terraform:       + vpc_endpoint_type     = "Gateway"
08:33:17.736 STDOUT [aws] terraform:       + vpc_id                = (known after apply)
08:33:17.736 STDOUT [aws] terraform:       + dns_options (known after apply)
08:33:17.736 STDOUT [aws] terraform:       + subnet_configuration (known after apply)
08:33:17.736 STDOUT [aws] terraform:     }
08:33:17.736 STDOUT [aws] terraform:   # module.openmetadata_aurora.aws_db_subnet_group.aurora_group will be created
08:33:17.736 STDOUT [aws] terraform:   + resource "aws_db_subnet_group" "aurora_group" {
08:33:17.736 STDOUT [aws] terraform:       + arn                     = (known after apply)
08:33:17.736 STDOUT [aws] terraform:       + description             = "Managed by Terraform"
08:33:17.736 STDOUT [aws] terraform:       + id                      = (known after apply)
08:33:17.736 STDOUT [aws] terraform:       + name                    = "ethan-dev-aurora-apne1-subnet-group"
08:33:17.736 STDOUT [aws] terraform:       + name_prefix             = (known after apply)
08:33:17.736 STDOUT [aws] terraform:       + region                  = "ap-northeast-1"
08:33:17.736 STDOUT [aws] terraform:       + subnet_ids              = (known after apply)
08:33:17.737 STDOUT [aws] terraform:       + supported_network_types = (known after apply)
08:33:17.737 STDOUT [aws] terraform:       + tags_all                = (known after apply)
08:33:17.737 STDOUT [aws] terraform:       + vpc_id                  = (known after apply)
08:33:17.737 STDOUT [aws] terraform:     }
08:33:17.737 STDOUT [aws] terraform:   # module.openmetadata_aurora.aws_rds_cluster.aurora will be created
08:33:17.737 STDOUT [aws] terraform:   + resource "aws_rds_cluster" "aurora" {
08:33:17.737 STDOUT [aws] terraform:       + allocated_storage                     = (known after apply)
08:33:17.737 STDOUT [aws] terraform:       + apply_immediately                     = (known after apply)
08:33:17.737 STDOUT [aws] terraform:       + arn                                   = (known after apply)
08:33:17.737 STDOUT [aws] terraform:       + availability_zones                    = (known after apply)
08:33:17.737 STDOUT [aws] terraform:       + backup_retention_period               = 1
08:33:17.737 STDOUT [aws] terraform:       + ca_certificate_identifier             = (known after apply)
08:33:17.737 STDOUT [aws] terraform:       + ca_certificate_valid_till             = (known after apply)
08:33:17.737 STDOUT [aws] terraform:       + cluster_identifier                    = "ethan-dev-aurora-apne1-cluster"
08:33:17.737 STDOUT [aws] terraform:       + cluster_identifier_prefix             = (known after apply)
08:33:17.738 STDOUT [aws] terraform:       + cluster_members                       = (known after apply)
08:33:17.738 STDOUT [aws] terraform:       + cluster_resource_id                   = (known after apply)
08:33:17.738 STDOUT [aws] terraform:       + cluster_scalability_type              = (known after apply)
08:33:17.738 STDOUT [aws] terraform:       + copy_tags_to_snapshot                 = false
08:33:17.738 STDOUT [aws] terraform:       + database_insights_mode                = (known after apply)
08:33:17.738 STDOUT [aws] terraform:       + database_name                         = "openmetadata"
08:33:17.738 STDOUT [aws] terraform:       + db_cluster_parameter_group_name       = "ethan-dev-aurora-apne1-param-group"
08:33:17.738 STDOUT [aws] terraform:       + db_subnet_group_name                  = "ethan-dev-aurora-apne1-subnet-group"
08:33:17.738 STDOUT [aws] terraform:       + db_system_id                          = (known after apply)
08:33:17.738 STDOUT [aws] terraform:       + delete_automated_backups              = true
08:33:17.738 STDOUT [aws] terraform:       + deletion_protection                   = true
08:33:17.738 STDOUT [aws] terraform:       + enable_global_write_forwarding        = false
08:33:17.738 STDOUT [aws] terraform:       + enable_http_endpoint                  = true
08:33:17.738 STDOUT [aws] terraform:       + enable_local_write_forwarding         = false
08:33:17.739 STDOUT [aws] terraform:       + enabled_cloudwatch_logs_exports       = [
08:33:17.739 STDOUT [aws] terraform:           + "postgresql",
08:33:17.739 STDOUT [aws] terraform:         ]
08:33:17.739 STDOUT [aws] terraform:       + endpoint                              = (known after apply)
08:33:17.739 STDOUT [aws] terraform:       + engine                                = "aurora-postgresql"
08:33:17.739 STDOUT [aws] terraform:       + engine_lifecycle_support              = (known after apply)
08:33:17.739 STDOUT [aws] terraform:       + engine_mode                           = "provisioned"
08:33:17.739 STDOUT [aws] terraform:       + engine_version                        = "16.2"
08:33:17.739 STDOUT [aws] terraform:       + engine_version_actual                 = (known after apply)
08:33:17.739 STDOUT [aws] terraform:       + hosted_zone_id                        = (known after apply)
08:33:17.739 STDOUT [aws] terraform:       + iam_database_authentication_enabled   = true
08:33:17.739 STDOUT [aws] terraform:       + iam_roles                             = (known after apply)
08:33:17.739 STDOUT [aws] terraform:       + id                                    = (known after apply)
08:33:17.739 STDOUT [aws] terraform:       + kms_key_id                            = (known after apply)
08:33:17.739 STDOUT [aws] terraform:       + master_password                       = (sensitive value)
08:33:17.740 STDOUT [aws] terraform:       + master_password_wo                    = (write-only attribute)
08:33:17.740 STDOUT [aws] terraform:       + master_user_secret                    = (known after apply)
08:33:17.740 STDOUT [aws] terraform:       + master_user_secret_kms_key_id         = (known after apply)
08:33:17.740 STDOUT [aws] terraform:       + master_username                       = "openmetadata_admin"
08:33:17.740 STDOUT [aws] terraform:       + monitoring_interval                   = (known after apply)
08:33:17.740 STDOUT [aws] terraform:       + monitoring_role_arn                   = (known after apply)
08:33:17.740 STDOUT [aws] terraform:       + network_type                          = (known after apply)
08:33:17.740 STDOUT [aws] terraform:       + performance_insights_kms_key_id       = (known after apply)
08:33:17.740 STDOUT [aws] terraform:       + performance_insights_retention_period = (known after apply)
08:33:17.740 STDOUT [aws] terraform:       + port                                  = (known after apply)
08:33:17.740 STDOUT [aws] terraform:       + preferred_backup_window               = "08:00-08:30"
08:33:17.740 STDOUT [aws] terraform:       + preferred_maintenance_window          = "sun:09:00-sun:09:30"
08:33:17.740 STDOUT [aws] terraform:       + reader_endpoint                       = (known after apply)
08:33:17.740 STDOUT [aws] terraform:       + region                                = "ap-northeast-1"
08:33:17.740 STDOUT [aws] terraform:       + skip_final_snapshot                   = true
08:33:17.741 STDOUT [aws] terraform:       + storage_encrypted                     = true
08:33:17.741 STDOUT [aws] terraform:       + storage_type                          = (known after apply)
08:33:17.741 STDOUT [aws] terraform:       + tags_all                              = (known after apply)
08:33:17.741 STDOUT [aws] terraform:       + vpc_security_group_ids                = (known after apply)
08:33:17.741 STDOUT [aws] terraform:       + serverlessv2_scaling_configuration {
08:33:17.741 STDOUT [aws] terraform:           + max_capacity             = 1
08:33:17.741 STDOUT [aws] terraform:           + min_capacity             = 0
08:33:17.741 STDOUT [aws] terraform:           + seconds_until_auto_pause = (known after apply)
08:33:17.741 STDOUT [aws] terraform:         }
08:33:17.741 STDOUT [aws] terraform:     }
08:33:17.741 STDOUT [aws] terraform:   # module.openmetadata_aurora.aws_rds_cluster_instance.aurora_instance[0] will be created
08:33:17.741 STDOUT [aws] terraform:   + resource "aws_rds_cluster_instance" "aurora_instance" {
08:33:17.741 STDOUT [aws] terraform:       + apply_immediately                     = (known after apply)
08:33:17.741 STDOUT [aws] terraform:       + arn                                   = (known after apply)
08:33:17.741 STDOUT [aws] terraform:       + auto_minor_version_upgrade            = true
08:33:17.741 STDOUT [aws] terraform:       + availability_zone                     = (known after apply)
08:33:17.741 STDOUT [aws] terraform:       + ca_cert_identifier                    = (known after apply)
08:33:17.742 STDOUT [aws] terraform:       + cluster_identifier                    = (known after apply)
08:33:17.742 STDOUT [aws] terraform:       + copy_tags_to_snapshot                 = false
08:33:17.742 STDOUT [aws] terraform:       + db_parameter_group_name               = (known after apply)
08:33:17.742 STDOUT [aws] terraform:       + db_subnet_group_name                  = "ethan-dev-aurora-apne1-subnet-group"
08:33:17.742 STDOUT [aws] terraform:       + dbi_resource_id                       = (known after apply)
08:33:17.742 STDOUT [aws] terraform:       + endpoint                              = (known after apply)
08:33:17.742 STDOUT [aws] terraform:       + engine                                = "aurora-postgresql"
08:33:17.742 STDOUT [aws] terraform:       + engine_version                        = "16.2"
08:33:17.742 STDOUT [aws] terraform:       + engine_version_actual                 = (known after apply)
08:33:17.742 STDOUT [aws] terraform:       + force_destroy                         = false
08:33:17.742 STDOUT [aws] terraform:       + id                                    = (known after apply)
08:33:17.742 STDOUT [aws] terraform:       + identifier                            = "ethan-dev-aurora-apne1-instance-0"
08:33:17.742 STDOUT [aws] terraform:       + identifier_prefix                     = (known after apply)
08:33:17.743 STDOUT [aws] terraform:       + instance_class                        = "db.serverless"
08:33:17.743 STDOUT [aws] terraform:       + kms_key_id                            = (known after apply)
08:33:17.743 STDOUT [aws] terraform:       + monitoring_interval                   = 0
08:33:17.743 STDOUT [aws] terraform:       + monitoring_role_arn                   = (known after apply)
08:33:17.743 STDOUT [aws] terraform:       + network_type                          = (known after apply)
08:33:17.743 STDOUT [aws] terraform:       + performance_insights_enabled          = (known after apply)
08:33:17.743 STDOUT [aws] terraform:       + performance_insights_kms_key_id       = (known after apply)
08:33:17.743 STDOUT [aws] terraform:       + performance_insights_retention_period = (known after apply)
08:33:17.743 STDOUT [aws] terraform:       + port                                  = (known after apply)
08:33:17.743 STDOUT [aws] terraform:       + preferred_backup_window               = (known after apply)
08:33:17.743 STDOUT [aws] terraform:       + preferred_maintenance_window          = "sun:09:00-sun:09:30"
08:33:17.743 STDOUT [aws] terraform:       + promotion_tier                        = 0
08:33:17.743 STDOUT [aws] terraform:       + publicly_accessible                   = false
08:33:17.744 STDOUT [aws] terraform:       + region                                = "ap-northeast-1"
08:33:17.744 STDOUT [aws] terraform:       + storage_encrypted                     = (known after apply)
08:33:17.744 STDOUT [aws] terraform:       + tags_all                              = (known after apply)
08:33:17.744 STDOUT [aws] terraform:       + writer                                = (known after apply)
08:33:17.744 STDOUT [aws] terraform:     }
08:33:17.744 STDOUT [aws] terraform:   # module.openmetadata_aurora.aws_rds_cluster_parameter_group.aurora_param will be created
08:33:17.744 STDOUT [aws] terraform:   + resource "aws_rds_cluster_parameter_group" "aurora_param" {
08:33:17.744 STDOUT [aws] terraform:       + arn         = (known after apply)
08:33:17.744 STDOUT [aws] terraform:       + description = "Managed by Terraform"
08:33:17.744 STDOUT [aws] terraform:       + family      = "aurora-postgresql16"
08:33:17.744 STDOUT [aws] terraform:       + id          = (known after apply)
08:33:17.744 STDOUT [aws] terraform:       + name        = "ethan-dev-aurora-apne1-param-group"
08:33:17.744 STDOUT [aws] terraform:       + name_prefix = (known after apply)
08:33:17.744 STDOUT [aws] terraform:       + region      = "ap-northeast-1"
08:33:17.744 STDOUT [aws] terraform:       + tags_all    = (known after apply)
08:33:17.744 STDOUT [aws] terraform:       + parameter {
08:33:17.745 STDOUT [aws] terraform:           + apply_method = "immediate"
08:33:17.745 STDOUT [aws] terraform:           + name         = "timezone"
08:33:17.745 STDOUT [aws] terraform:           + value        = "Asia/Tokyo"
08:33:17.745 STDOUT [aws] terraform:         }
08:33:17.745 STDOUT [aws] terraform:     }
08:33:17.745 STDOUT [aws] terraform:   # module.openmetadata_cloudwatch.aws_cloudwatch_log_group.elastic_search will be created
08:33:17.745 STDOUT [aws] terraform:   + resource "aws_cloudwatch_log_group" "elastic_search" {
08:33:17.745 STDOUT [aws] terraform:       + arn               = (known after apply)
08:33:17.745 STDOUT [aws] terraform:       + id                = (known after apply)
08:33:17.745 STDOUT [aws] terraform:       + log_group_class   = (known after apply)
08:33:17.745 STDOUT [aws] terraform:       + name              = "/aws/ecs/elastic-search"
08:33:17.745 STDOUT [aws] terraform:       + name_prefix       = (known after apply)
08:33:17.745 STDOUT [aws] terraform:       + region            = "ap-northeast-1"
08:33:17.745 STDOUT [aws] terraform:       + retention_in_days = 30
08:33:17.745 STDOUT [aws] terraform:       + skip_destroy      = false
08:33:17.745 STDOUT [aws] terraform:       + tags_all          = (known after apply)
08:33:17.745 STDOUT [aws] terraform:     }
08:33:17.745 STDOUT [aws] terraform:   # module.openmetadata_cloudwatch.aws_cloudwatch_log_group.migrate_all will be created
08:33:17.746 STDOUT [aws] terraform:   + resource "aws_cloudwatch_log_group" "migrate_all" {
08:33:17.746 STDOUT [aws] terraform:       + arn               = (known after apply)
08:33:17.746 STDOUT [aws] terraform:       + id                = (known after apply)
08:33:17.746 STDOUT [aws] terraform:       + log_group_class   = (known after apply)
08:33:17.746 STDOUT [aws] terraform:       + name              = "/aws/ecs/migrate-all"
08:33:17.746 STDOUT [aws] terraform:       + name_prefix       = (known after apply)
08:33:17.746 STDOUT [aws] terraform:       + region            = "ap-northeast-1"
08:33:17.746 STDOUT [aws] terraform:       + retention_in_days = 30
08:33:17.746 STDOUT [aws] terraform:       + skip_destroy      = false
08:33:17.746 STDOUT [aws] terraform:       + tags_all          = (known after apply)
08:33:17.746 STDOUT [aws] terraform:     }
08:33:17.746 STDOUT [aws] terraform:   # module.openmetadata_cloudwatch.aws_cloudwatch_log_group.openmetadata_airflow will be created
08:33:17.746 STDOUT [aws] terraform:   + resource "aws_cloudwatch_log_group" "openmetadata_airflow" {
08:33:17.746 STDOUT [aws] terraform:       + arn               = (known after apply)
08:33:17.746 STDOUT [aws] terraform:       + id                = (known after apply)
08:33:17.747 STDOUT [aws] terraform:       + log_group_class   = (known after apply)
08:33:17.747 STDOUT [aws] terraform:       + name              = "/aws/ecs/openmetadata-airflow"
08:33:17.747 STDOUT [aws] terraform:       + name_prefix       = (known after apply)
08:33:17.747 STDOUT [aws] terraform:       + region            = "ap-northeast-1"
08:33:17.747 STDOUT [aws] terraform:       + retention_in_days = 30
08:33:17.747 STDOUT [aws] terraform:       + skip_destroy      = false
08:33:17.747 STDOUT [aws] terraform:       + tags_all          = (known after apply)
08:33:17.747 STDOUT [aws] terraform:     }
08:33:17.747 STDOUT [aws] terraform:   # module.openmetadata_cloudwatch.aws_cloudwatch_log_group.openmetadata_server will be created
08:33:17.747 STDOUT [aws] terraform:   + resource "aws_cloudwatch_log_group" "openmetadata_server" {
08:33:17.747 STDOUT [aws] terraform:       + arn               = (known after apply)
08:33:17.747 STDOUT [aws] terraform:       + id                = (known after apply)
08:33:17.747 STDOUT [aws] terraform:       + log_group_class   = (known after apply)
08:33:17.747 STDOUT [aws] terraform:       + name              = "/aws/ecs/openmetadata-server"
08:33:17.747 STDOUT [aws] terraform:       + name_prefix       = (known after apply)
08:33:17.747 STDOUT [aws] terraform:       + region            = "ap-northeast-1"
08:33:17.748 STDOUT [aws] terraform:       + retention_in_days = 30
08:33:17.748 STDOUT [aws] terraform:       + skip_destroy      = false
08:33:17.748 STDOUT [aws] terraform:       + tags_all          = (known after apply)
08:33:17.748 STDOUT [aws] terraform:     }
08:33:17.748 STDOUT [aws] terraform:   # module.openmetadata_ecr.aws_ecr_repository.openmetadata["elasticsearch"] will be created
08:33:17.748 STDOUT [aws] terraform:   + resource "aws_ecr_repository" "openmetadata" {
08:33:17.748 STDOUT [aws] terraform:       + arn                  = (known after apply)
08:33:17.748 STDOUT [aws] terraform:       + force_delete         = true
08:33:17.748 STDOUT [aws] terraform:       + id                   = (known after apply)
08:33:17.748 STDOUT [aws] terraform:       + image_tag_mutability = "MUTABLE"
08:33:17.748 STDOUT [aws] terraform:       + name                 = "elasticsearch"
08:33:17.748 STDOUT [aws] terraform:       + region               = "ap-northeast-1"
08:33:17.748 STDOUT [aws] terraform:       + registry_id          = (known after apply)
08:33:17.748 STDOUT [aws] terraform:       + repository_url       = (known after apply)
08:33:17.748 STDOUT [aws] terraform:       + tags_all             = (known after apply)
08:33:17.748 STDOUT [aws] terraform:       + encryption_configuration {
08:33:17.748 STDOUT [aws] terraform:           + encryption_type = "KMS"
08:33:17.748 STDOUT [aws] terraform:           + kms_key         = (known after apply)
08:33:17.748 STDOUT [aws] terraform:         }
08:33:17.748 STDOUT [aws] terraform:       + image_scanning_configuration {
08:33:17.749 STDOUT [aws] terraform:           + scan_on_push = true
08:33:17.749 STDOUT [aws] terraform:         }
08:33:17.749 STDOUT [aws] terraform:     }
08:33:17.749 STDOUT [aws] terraform:   # module.openmetadata_ecr.aws_ecr_repository.openmetadata["openmetadata/ingestion"] will be created
08:33:17.749 STDOUT [aws] terraform:   + resource "aws_ecr_repository" "openmetadata" {
08:33:17.749 STDOUT [aws] terraform:       + arn                  = (known after apply)
08:33:17.749 STDOUT [aws] terraform:       + force_delete         = true
08:33:17.749 STDOUT [aws] terraform:       + id                   = (known after apply)
08:33:17.749 STDOUT [aws] terraform:       + image_tag_mutability = "MUTABLE"
08:33:17.749 STDOUT [aws] terraform:       + name                 = "openmetadata/ingestion"
08:33:17.749 STDOUT [aws] terraform:       + region               = "ap-northeast-1"
08:33:17.749 STDOUT [aws] terraform:       + registry_id          = (known after apply)
08:33:17.749 STDOUT [aws] terraform:       + repository_url       = (known after apply)
08:33:17.749 STDOUT [aws] terraform:       + tags_all             = (known after apply)
08:33:17.749 STDOUT [aws] terraform:       + encryption_configuration {
08:33:17.749 STDOUT [aws] terraform:           + encryption_type = "KMS"
08:33:17.749 STDOUT [aws] terraform:           + kms_key         = (known after apply)
08:33:17.749 STDOUT [aws] terraform:         }
08:33:17.750 STDOUT [aws] terraform:       + image_scanning_configuration {
08:33:17.750 STDOUT [aws] terraform:           + scan_on_push = true
08:33:17.750 STDOUT [aws] terraform:         }
08:33:17.750 STDOUT [aws] terraform:     }
08:33:17.750 STDOUT [aws] terraform:   # module.openmetadata_ecr.aws_ecr_repository.openmetadata["openmetadata/server"] will be created
08:33:17.750 STDOUT [aws] terraform:   + resource "aws_ecr_repository" "openmetadata" {
08:33:17.750 STDOUT [aws] terraform:       + arn                  = (known after apply)
08:33:17.750 STDOUT [aws] terraform:       + force_delete         = true
08:33:17.750 STDOUT [aws] terraform:       + id                   = (known after apply)
08:33:17.750 STDOUT [aws] terraform:       + image_tag_mutability = "MUTABLE"
08:33:17.750 STDOUT [aws] terraform:       + name                 = "openmetadata/server"
08:33:17.750 STDOUT [aws] terraform:       + region               = "ap-northeast-1"
08:33:17.750 STDOUT [aws] terraform:       + registry_id          = (known after apply)
08:33:17.750 STDOUT [aws] terraform:       + repository_url       = (known after apply)
08:33:17.750 STDOUT [aws] terraform:       + tags_all             = (known after apply)
08:33:17.750 STDOUT [aws] terraform:       + encryption_configuration {
08:33:17.750 STDOUT [aws] terraform:           + encryption_type = "KMS"
08:33:17.750 STDOUT [aws] terraform:           + kms_key         = (known after apply)
08:33:17.750 STDOUT [aws] terraform:         }
08:33:17.750 STDOUT [aws] terraform:       + image_scanning_configuration {
08:33:17.751 STDOUT [aws] terraform:           + scan_on_push = true
08:33:17.751 STDOUT [aws] terraform:         }
08:33:17.751 STDOUT [aws] terraform:     }
08:33:17.751 STDOUT [aws] terraform:   # module.openmetadata_ecr.terraform_data.build_elasticsearch_image will be created
08:33:17.751 STDOUT [aws] terraform:   + resource "terraform_data" "build_elasticsearch_image" {
08:33:17.751 STDOUT [aws] terraform:       + id               = (known after apply)
08:33:17.751 STDOUT [aws] terraform:       + triggers_replace = [
08:33:17.751 STDOUT [aws] terraform:           + (known after apply),
08:33:17.751 STDOUT [aws] terraform:           + "c5655737279aa8febab6274def5051ea92d00a9d7b2f2520441d13bb01e5c110",
08:33:17.751 STDOUT [aws] terraform:         ]
08:33:17.751 STDOUT [aws] terraform:     }
08:33:17.751 STDOUT [aws] terraform:   # module.openmetadata_ecr.terraform_data.build_ingestion_image will be created
08:33:17.751 STDOUT [aws] terraform:   + resource "terraform_data" "build_ingestion_image" {
08:33:17.751 STDOUT [aws] terraform:       + id               = (known after apply)
08:33:17.751 STDOUT [aws] terraform:       + triggers_replace = [
08:33:17.751 STDOUT [aws] terraform:           + (known after apply),
08:33:17.751 STDOUT [aws] terraform:           + "7b4c71b5559a5f6489416eac6fb5e910254e00113aa7049045f287320a7f0cec",
08:33:17.751 STDOUT [aws] terraform:         ]
08:33:17.751 STDOUT [aws] terraform:     }
08:33:17.751 STDOUT [aws] terraform:   # module.openmetadata_ecr.terraform_data.build_openmetadata_image will be created
08:33:17.752 STDOUT [aws] terraform:   + resource "terraform_data" "build_openmetadata_image" {
08:33:17.752 STDOUT [aws] terraform:       + id               = (known after apply)
08:33:17.752 STDOUT [aws] terraform:       + triggers_replace = [
08:33:17.752 STDOUT [aws] terraform:           + (known after apply),
08:33:17.752 STDOUT [aws] terraform:           + "599c51ccbe631608fd6425a568dc977cd22791ac9ea1f720cb5e46bcca14d751",
08:33:17.752 STDOUT [aws] terraform:         ]
08:33:17.752 STDOUT [aws] terraform:     }
08:33:17.752 STDOUT [aws] terraform:   # module.openmetadata_ecs.aws_ecs_cluster.this will be created
08:33:17.752 STDOUT [aws] terraform:   + resource "aws_ecs_cluster" "this" {
08:33:17.752 STDOUT [aws] terraform:       + arn      = (known after apply)
08:33:17.752 STDOUT [aws] terraform:       + id       = (known after apply)
08:33:17.752 STDOUT [aws] terraform:       + name     = "ethan-dev-ecs-apne1-cluster"
08:33:17.752 STDOUT [aws] terraform:       + region   = "ap-northeast-1"
08:33:17.752 STDOUT [aws] terraform:       + tags_all = (known after apply)
08:33:17.752 STDOUT [aws] terraform:       + setting {
08:33:17.752 STDOUT [aws] terraform:           + name  = "containerInsights"
08:33:17.752 STDOUT [aws] terraform:           + value = "enabled"
08:33:17.752 STDOUT [aws] terraform:         }
08:33:17.752 STDOUT [aws] terraform:     }
08:33:17.752 STDOUT [aws] terraform:   # module.openmetadata_ecs.aws_ecs_service.this will be created
08:33:17.752 STDOUT [aws] terraform:   + resource "aws_ecs_service" "this" {
08:33:17.752 STDOUT [aws] terraform:       + arn                                = (known after apply)
08:33:17.753 STDOUT [aws] terraform:       + availability_zone_rebalancing      = "DISABLED"
08:33:17.753 STDOUT [aws] terraform:       + cluster                            = (known after apply)
08:33:17.753 STDOUT [aws] terraform:       + deployment_maximum_percent         = 200
08:33:17.753 STDOUT [aws] terraform:       + deployment_minimum_healthy_percent = 100
08:33:17.753 STDOUT [aws] terraform:       + desired_count                      = 1
08:33:17.753 STDOUT [aws] terraform:       + enable_ecs_managed_tags            = false
08:33:17.753 STDOUT [aws] terraform:       + enable_execute_command             = true
08:33:17.753 STDOUT [aws] terraform:       + iam_role                           = (known after apply)
08:33:17.753 STDOUT [aws] terraform:       + id                                 = (known after apply)
08:33:17.753 STDOUT [aws] terraform:       + launch_type                        = "FARGATE"
08:33:17.753 STDOUT [aws] terraform:       + name                               = "openmetadata-service"
08:33:17.753 STDOUT [aws] terraform:       + platform_version                   = "LATEST"
08:33:17.753 STDOUT [aws] terraform:       + region                             = "ap-northeast-1"
08:33:17.753 STDOUT [aws] terraform:       + scheduling_strategy                = "REPLICA"
08:33:17.753 STDOUT [aws] terraform:       + tags_all                           = (known after apply)
08:33:17.753 STDOUT [aws] terraform:       + task_definition                    = (known after apply)
08:33:17.754 STDOUT [aws] terraform:       + triggers                           = (known after apply)
08:33:17.754 STDOUT [aws] terraform:       + wait_for_steady_state              = true
08:33:17.754 STDOUT [aws] terraform:       + load_balancer {
08:33:17.754 STDOUT [aws] terraform:           + container_name   = "openmetadata_server"
08:33:17.754 STDOUT [aws] terraform:           + container_port   = 8585
08:33:17.754 STDOUT [aws] terraform:           + target_group_arn = (known after apply)
08:33:17.754 STDOUT [aws] terraform:             # (1 unchanged attribute hidden)
08:33:17.754 STDOUT [aws] terraform:         }
08:33:17.754 STDOUT [aws] terraform:       + network_configuration {
08:33:17.754 STDOUT [aws] terraform:           + assign_public_ip = false
08:33:17.754 STDOUT [aws] terraform:           + security_groups  = (known after apply)
08:33:17.754 STDOUT [aws] terraform:           + subnets          = (known after apply)
08:33:17.754 STDOUT [aws] terraform:         }
08:33:17.754 STDOUT [aws] terraform:     }
08:33:17.754 STDOUT [aws] terraform:   # module.openmetadata_ecs.aws_ecs_task_definition.openmetadata will be created
08:33:17.754 STDOUT [aws] terraform:   + resource "aws_ecs_task_definition" "openmetadata" {
08:33:17.754 STDOUT [aws] terraform:       + arn                      = (known after apply)
08:33:17.754 STDOUT [aws] terraform:       + arn_without_revision     = (known after apply)
08:33:17.754 STDOUT [aws] terraform:       + container_definitions    = (sensitive value)
08:33:17.755 STDOUT [aws] terraform:       + cpu                      = "8192"
08:33:17.755 STDOUT [aws] terraform:       + enable_fault_injection   = (known after apply)
08:33:17.755 STDOUT [aws] terraform:       + execution_role_arn       = (known after apply)
08:33:17.755 STDOUT [aws] terraform:       + family                   = "openmetadata"
08:33:17.755 STDOUT [aws] terraform:       + id                       = (known after apply)
08:33:17.755 STDOUT [aws] terraform:       + memory                   = "16384"
08:33:17.755 STDOUT [aws] terraform:       + network_mode             = "awsvpc"
08:33:17.755 STDOUT [aws] terraform:       + region                   = "ap-northeast-1"
08:33:17.755 STDOUT [aws] terraform:       + requires_compatibilities = [
08:33:17.755 STDOUT [aws] terraform:           + "FARGATE",
08:33:17.755 STDOUT [aws] terraform:         ]
08:33:17.755 STDOUT [aws] terraform:       + revision                 = (known after apply)
08:33:17.755 STDOUT [aws] terraform:       + skip_destroy             = false
08:33:17.755 STDOUT [aws] terraform:       + tags_all                 = (known after apply)
08:33:17.755 STDOUT [aws] terraform:       + task_role_arn            = (known after apply)
08:33:17.755 STDOUT [aws] terraform:       + track_latest             = false
08:33:17.755 STDOUT [aws] terraform:       + ephemeral_storage {
08:33:17.755 STDOUT [aws] terraform:           + size_in_gib = 60
08:33:17.755 STDOUT [aws] terraform:         }
08:33:17.755 STDOUT [aws] terraform:       + runtime_platform {
08:33:17.756 STDOUT [aws] terraform:           + operating_system_family = "LINUX"
08:33:17.756 STDOUT [aws] terraform:         }
08:33:17.756 STDOUT [aws] terraform:     }
08:33:17.756 STDOUT [aws] terraform:   # module.openmetadata_iam.aws_iam_policy.ecs_task will be created
08:33:17.756 STDOUT [aws] terraform:   + resource "aws_iam_policy" "ecs_task" {
08:33:17.756 STDOUT [aws] terraform:       + arn              = (known after apply)
08:33:17.756 STDOUT [aws] terraform:       + attachment_count = (known after apply)
08:33:17.756 STDOUT [aws] terraform:       + id               = (known after apply)
08:33:17.756 STDOUT [aws] terraform:       + name             = "ethan-dev-policy-apne1-ecs-task"
08:33:17.756 STDOUT [aws] terraform:       + name_prefix      = (known after apply)
08:33:17.756 STDOUT [aws] terraform:       + path             = "/"
08:33:17.756 STDOUT [aws] terraform:       + policy           = (known after apply)
08:33:17.756 STDOUT [aws] terraform:       + policy_id        = (known after apply)
08:33:17.756 STDOUT [aws] terraform:       + tags_all         = (known after apply)
08:33:17.756 STDOUT [aws] terraform:     }
08:33:17.756 STDOUT [aws] terraform:   # module.openmetadata_iam.aws_iam_policy.ecs_task_execution will be created
08:33:17.756 STDOUT [aws] terraform:   + resource "aws_iam_policy" "ecs_task_execution" {
08:33:17.756 STDOUT [aws] terraform:       + arn              = (known after apply)
08:33:17.756 STDOUT [aws] terraform:       + attachment_count = (known after apply)
08:33:17.756 STDOUT [aws] terraform:       + id               = (known after apply)
08:33:17.757 STDOUT [aws] terraform:       + name             = "ethan-dev-policy-apne1-ecs-task-execution"
08:33:17.757 STDOUT [aws] terraform:       + name_prefix      = (known after apply)
08:33:17.757 STDOUT [aws] terraform:       + path             = "/"
08:33:17.757 STDOUT [aws] terraform:       + policy           = (known after apply)
08:33:17.757 STDOUT [aws] terraform:       + policy_id        = (known after apply)
08:33:17.757 STDOUT [aws] terraform:       + tags_all         = (known after apply)
08:33:17.757 STDOUT [aws] terraform:     }
08:33:17.757 STDOUT [aws] terraform:   # module.openmetadata_iam.aws_iam_role.ecs_task will be created
08:33:17.757 STDOUT [aws] terraform:   + resource "aws_iam_role" "ecs_task" {
08:33:17.757 STDOUT [aws] terraform:       + arn                   = (known after apply)
08:33:17.757 STDOUT [aws] terraform:       + assume_role_policy    = jsonencode(
08:33:17.757 STDOUT [aws] terraform:             {
08:33:17.757 STDOUT [aws] terraform:               + Statement = [
08:33:17.757 STDOUT [aws] terraform:                   + {
08:33:17.757 STDOUT [aws] terraform:                       + Action    = "sts:AssumeRole"
08:33:17.757 STDOUT [aws] terraform:                       + Condition = {
08:33:17.757 STDOUT [aws] terraform:                           + ArnLike      = {
08:33:17.757 STDOUT [aws] terraform:                               + "aws:SourceArn" = "arn:aws:ecs:ap-northeast-1:921407950230:*"
08:33:17.757 STDOUT [aws] terraform:                             }
08:33:17.757 STDOUT [aws] terraform:                           + StringEquals = {
08:33:17.758 STDOUT [aws] terraform:                               + "aws:SourceAccount" = "921407950230"
08:33:17.758 STDOUT [aws] terraform:                             }
08:33:17.758 STDOUT [aws] terraform:                         }
08:33:17.758 STDOUT [aws] terraform:                       + Effect    = "Allow"
08:33:17.758 STDOUT [aws] terraform:                       + Principal = {
08:33:17.758 STDOUT [aws] terraform:                           + Service = [
08:33:17.758 STDOUT [aws] terraform:                               + "ecs-tasks.amazonaws.com",
08:33:17.758 STDOUT [aws] terraform:                             ]
08:33:17.758 STDOUT [aws] terraform:                         }
08:33:17.758 STDOUT [aws] terraform:                     },
08:33:17.758 STDOUT [aws] terraform:                 ]
08:33:17.758 STDOUT [aws] terraform:               + Version   = "2012-10-17"
08:33:17.758 STDOUT [aws] terraform:             }
08:33:17.758 STDOUT [aws] terraform:         )
08:33:17.758 STDOUT [aws] terraform:       + create_date           = (known after apply)
08:33:17.758 STDOUT [aws] terraform:       + force_detach_policies = false
08:33:17.758 STDOUT [aws] terraform:       + id                    = (known after apply)
08:33:17.758 STDOUT [aws] terraform:       + managed_policy_arns   = (known after apply)
08:33:17.758 STDOUT [aws] terraform:       + max_session_duration  = 3600
08:33:17.758 STDOUT [aws] terraform:       + name                  = "ethan-dev-role-apne1-ecs-task"
08:33:17.758 STDOUT [aws] terraform:       + name_prefix           = (known after apply)
08:33:17.758 STDOUT [aws] terraform:       + path                  = "/"
08:33:17.759 STDOUT [aws] terraform:       + tags_all              = (known after apply)
08:33:17.759 STDOUT [aws] terraform:       + unique_id             = (known after apply)
08:33:17.759 STDOUT [aws] terraform:       + inline_policy (known after apply)
08:33:17.759 STDOUT [aws] terraform:     }
08:33:17.759 STDOUT [aws] terraform:   # module.openmetadata_iam.aws_iam_role.ecs_task_execution will be created
08:33:17.759 STDOUT [aws] terraform:   + resource "aws_iam_role" "ecs_task_execution" {
08:33:17.759 STDOUT [aws] terraform:       + arn                   = (known after apply)
08:33:17.759 STDOUT [aws] terraform:       + assume_role_policy    = jsonencode(
08:33:17.759 STDOUT [aws] terraform:             {
08:33:17.759 STDOUT [aws] terraform:               + Statement = [
08:33:17.759 STDOUT [aws] terraform:                   + {
08:33:17.759 STDOUT [aws] terraform:                       + Action    = "sts:AssumeRole"
08:33:17.759 STDOUT [aws] terraform:                       + Effect    = "Allow"
08:33:17.759 STDOUT [aws] terraform:                       + Principal = {
08:33:17.759 STDOUT [aws] terraform:                           + Service = "ecs-tasks.amazonaws.com"
08:33:17.759 STDOUT [aws] terraform:                         }
08:33:17.759 STDOUT [aws] terraform:                       + Sid       = ""
08:33:17.759 STDOUT [aws] terraform:                     },
08:33:17.759 STDOUT [aws] terraform:                 ]
08:33:17.759 STDOUT [aws] terraform:               + Version   = "2012-10-17"
08:33:17.759 STDOUT [aws] terraform:             }
08:33:17.759 STDOUT [aws] terraform:         )
08:33:17.759 STDOUT [aws] terraform:       + create_date           = (known after apply)
08:33:17.760 STDOUT [aws] terraform:       + force_detach_policies = false
08:33:17.760 STDOUT [aws] terraform:       + id                    = (known after apply)
08:33:17.760 STDOUT [aws] terraform:       + managed_policy_arns   = (known after apply)
08:33:17.760 STDOUT [aws] terraform:       + max_session_duration  = 3600
08:33:17.760 STDOUT [aws] terraform:       + name                  = "ethan-dev-role-apne1-ecs-task-execution"
08:33:17.760 STDOUT [aws] terraform:       + name_prefix           = (known after apply)
08:33:17.760 STDOUT [aws] terraform:       + path                  = "/"
08:33:17.760 STDOUT [aws] terraform:       + tags_all              = (known after apply)
08:33:17.760 STDOUT [aws] terraform:       + unique_id             = (known after apply)
08:33:17.760 STDOUT [aws] terraform:       + inline_policy (known after apply)
08:33:17.760 STDOUT [aws] terraform:     }
08:33:17.760 STDOUT [aws] terraform:   # module.openmetadata_iam.aws_iam_role_policy_attachment.ecs_task will be created
08:33:17.760 STDOUT [aws] terraform:   + resource "aws_iam_role_policy_attachment" "ecs_task" {
08:33:17.760 STDOUT [aws] terraform:       + id         = (known after apply)
08:33:17.760 STDOUT [aws] terraform:       + policy_arn = (known after apply)
08:33:17.760 STDOUT [aws] terraform:       + role       = "ethan-dev-role-apne1-ecs-task"
08:33:17.760 STDOUT [aws] terraform:     }
08:33:17.760 STDOUT [aws] terraform:   # module.openmetadata_iam.aws_iam_role_policy_attachment.ecs_task_execution will be created
08:33:17.761 STDOUT [aws] terraform:   + resource "aws_iam_role_policy_attachment" "ecs_task_execution" {
08:33:17.761 STDOUT [aws] terraform:       + id         = (known after apply)
08:33:17.761 STDOUT [aws] terraform:       + policy_arn = (known after apply)
08:33:17.761 STDOUT [aws] terraform:       + role       = "ethan-dev-role-apne1-ecs-task-execution"
08:33:17.761 STDOUT [aws] terraform:     }
08:33:17.761 STDOUT [aws] terraform:   # module.openmetadata_kms_key.aws_kms_alias.aurora will be created
08:33:17.761 STDOUT [aws] terraform:   + resource "aws_kms_alias" "aurora" {
08:33:17.761 STDOUT [aws] terraform:       + arn            = (known after apply)
08:33:17.761 STDOUT [aws] terraform:       + id             = (known after apply)
08:33:17.761 STDOUT [aws] terraform:       + name           = "alias/ethan-dev-kms-apne1-aurora"
08:33:17.761 STDOUT [aws] terraform:       + name_prefix    = (known after apply)
08:33:17.761 STDOUT [aws] terraform:       + region         = "ap-northeast-1"
08:33:17.761 STDOUT [aws] terraform:       + target_key_arn = (known after apply)
08:33:17.761 STDOUT [aws] terraform:       + target_key_id  = (known after apply)
08:33:17.761 STDOUT [aws] terraform:     }
08:33:17.761 STDOUT [aws] terraform:   # module.openmetadata_kms_key.aws_kms_alias.ecr will be created
08:33:17.761 STDOUT [aws] terraform:   + resource "aws_kms_alias" "ecr" {
08:33:17.761 STDOUT [aws] terraform:       + arn            = (known after apply)
08:33:17.761 STDOUT [aws] terraform:       + id             = (known after apply)
08:33:17.762 STDOUT [aws] terraform:       + name           = "alias/ethan-dev-kms-apne1-ecr"
08:33:17.762 STDOUT [aws] terraform:       + name_prefix    = (known after apply)
08:33:17.762 STDOUT [aws] terraform:       + region         = "ap-northeast-1"
08:33:17.762 STDOUT [aws] terraform:       + target_key_arn = (known after apply)
08:33:17.762 STDOUT [aws] terraform:       + target_key_id  = (known after apply)
08:33:17.762 STDOUT [aws] terraform:     }
08:33:17.762 STDOUT [aws] terraform:   # module.openmetadata_kms_key.aws_kms_alias.s3 will be created
08:33:17.762 STDOUT [aws] terraform:   + resource "aws_kms_alias" "s3" {
08:33:17.762 STDOUT [aws] terraform:       + arn            = (known after apply)
08:33:17.762 STDOUT [aws] terraform:       + id             = (known after apply)
08:33:17.762 STDOUT [aws] terraform:       + name           = "alias/ethan-dev-kms-apne1-s3-
08:33:17.762 STDOUT [aws] terraform: envfile"
08:33:17.762 STDOUT [aws] terraform:       + name_prefix    = (known after apply)
08:33:17.762 STDOUT [aws] terraform:       + region         = "ap-northeast-1"
08:33:17.762 STDOUT [aws] terraform:       + target_key_arn = (known after apply)
08:33:17.762 STDOUT [aws] terraform:       + target_key_id  = (known after apply)
08:33:17.762 STDOUT [aws] terraform:     }
08:33:17.762 STDOUT [aws] terraform:   # module.openmetadata_kms_key.aws_kms_key.aurora will be created
08:33:17.762 STDOUT [aws] terraform:   + resource "aws_kms_key" "aurora" {
08:33:17.762 STDOUT [aws] terraform:       + arn                                = (known after apply)
08:33:17.763 STDOUT [aws] terraform:       + bypass_policy_lockout_safety_check = false
08:33:17.763 STDOUT [aws] terraform:       + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
08:33:17.763 STDOUT [aws] terraform:       + deletion_window_in_days            = 7
08:33:17.763 STDOUT [aws] terraform:       + description                        = "For Aurora"
08:33:17.763 STDOUT [aws] terraform:       + enable_key_rotation                = true
08:33:17.763 STDOUT [aws] terraform:       + id                                 = (known after apply)
08:33:17.763 STDOUT [aws] terraform:       + is_enabled                         = true
08:33:17.763 STDOUT [aws] terraform:       + key_id                             = (known after apply)
08:33:17.763 STDOUT [aws] terraform:       + key_usage                          = "ENCRYPT_DECRYPT"
08:33:17.763 STDOUT [aws] terraform:       + multi_region                       = (known after apply)
08:33:17.763 STDOUT [aws] terraform:       + policy                             = (known after apply)
08:33:17.763 STDOUT [aws] terraform:       + region                             = "ap-northeast-1"
08:33:17.763 STDOUT [aws] terraform:       + rotation_period_in_days            = 365
08:33:17.763 STDOUT [aws] terraform:       + tags                               = {
08:33:17.763 STDOUT [aws] terraform:           + "name" = "ethan-dev-kms-apne1-aurora"
08:33:17.764 STDOUT [aws] terraform:         }
08:33:17.764 STDOUT [aws] terraform:       + tags_all                           = {
08:33:17.764 STDOUT [aws] terraform:           + "name" = "ethan-dev-kms-apne1-aurora"
08:33:17.764 STDOUT [aws] terraform:         }
08:33:17.764 STDOUT [aws] terraform:     }
08:33:17.764 STDOUT [aws] terraform:   # module.openmetadata_kms_key.aws_kms_key.ecr will be created
08:33:17.764 STDOUT [aws] terraform:   + resource "aws_kms_key" "ecr" {
08:33:17.764 STDOUT [aws] terraform:       + arn                                = (known after apply)
08:33:17.764 STDOUT [aws] terraform:       + bypass_policy_lockout_safety_check = false
08:33:17.764 STDOUT [aws] terraform:       + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
08:33:17.764 STDOUT [aws] terraform:       + deletion_window_in_days            = 7
08:33:17.764 STDOUT [aws] terraform:       + description                        = "For ECR"
08:33:17.764 STDOUT [aws] terraform:       + enable_key_rotation                = true
08:33:17.764 STDOUT [aws] terraform:       + id                                 = (known after apply)
08:33:17.764 STDOUT [aws] terraform:       + is_enabled                         = true
08:33:17.764 STDOUT [aws] terraform:       + key_id                             = (known after apply)
08:33:17.764 STDOUT [aws] terraform:       + key_usage                          = "ENCRYPT_DECRYPT"
08:33:17.764 STDOUT [aws] terraform:       + multi_region                       = (known after apply)
08:33:17.764 STDOUT [aws] terraform:       + policy                             = (known after apply)
08:33:17.765 STDOUT [aws] terraform:       + region                             = "ap-northeast-1"
08:33:17.765 STDOUT [aws] terraform:       + rotation_period_in_days            = 365
08:33:17.765 STDOUT [aws] terraform:       + tags                               = {
08:33:17.765 STDOUT [aws] terraform:           + "name" = "ethan-dev-kms-apne1-ecr"
08:33:17.765 STDOUT [aws] terraform:         }
08:33:17.765 STDOUT [aws] terraform:       + tags_all                           = {
08:33:17.765 STDOUT [aws] terraform:           + "name" = "ethan-dev-kms-apne1-ecr"
08:33:17.765 STDOUT [aws] terraform:         }
08:33:17.765 STDOUT [aws] terraform:     }
08:33:17.765 STDOUT [aws] terraform:   # module.openmetadata_kms_key.aws_kms_key.s3 will be created
08:33:17.765 STDOUT [aws] terraform:   + resource "aws_kms_key" "s3" {
08:33:17.765 STDOUT [aws] terraform:       + arn                                = (known after apply)
08:33:17.765 STDOUT [aws] terraform:       + bypass_policy_lockout_safety_check = false
08:33:17.765 STDOUT [aws] terraform:       + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
08:33:17.765 STDOUT [aws] terraform:       + deletion_window_in_days            = 7
08:33:17.765 STDOUT [aws] terraform:       + description                        = "For s3"
08:33:17.765 STDOUT [aws] terraform:       + enable_key_rotation                = true
08:33:17.765 STDOUT [aws] terraform:       + id                                 = (known after apply)
08:33:17.765 STDOUT [aws] terraform:       + is_enabled                         = true
08:33:17.766 STDOUT [aws] terraform:       + key_id                             = (known after apply)
08:33:17.766 STDOUT [aws] terraform:       + key_usage                          = "ENCRYPT_DECRYPT"
08:33:17.766 STDOUT [aws] terraform:       + multi_region                       = (known after apply)
08:33:17.766 STDOUT [aws] terraform:       + policy                             = (known after apply)
08:33:17.766 STDOUT [aws] terraform:       + region                             = "ap-northeast-1"
08:33:17.766 STDOUT [aws] terraform:       + rotation_period_in_days            = 365
08:33:17.766 STDOUT [aws] terraform:       + tags                               = {
08:33:17.766 STDOUT [aws] terraform:           + "name" = "ethan-dev-kms-apne1-s3-envfile"
08:33:17.766 STDOUT [aws] terraform:         }
08:33:17.766 STDOUT [aws] terraform:       + tags_all                           = {
08:33:17.766 STDOUT [aws] terraform:           + "name" = "ethan-dev-kms-apne1-s3-envfile"
08:33:17.766 STDOUT [aws] terraform:         }
08:33:17.766 STDOUT [aws] terraform:     }
08:33:17.766 STDOUT [aws] terraform:   # module.openmetadata_lb.aws_lb.this will be created
08:33:17.766 STDOUT [aws] terraform:   + resource "aws_lb" "this" {
08:33:17.766 STDOUT [aws] terraform:       + arn                                                          = (known after apply)
08:33:17.766 STDOUT [aws] terraform:       + arn_suffix                                                   = (known after apply)
08:33:17.767 STDOUT [aws] terraform:       + client_keep_alive                                            = 3600
08:33:17.767 STDOUT [aws] terraform:       + desync_mitigation_mode                                       = "defensive"
08:33:17.767 STDOUT [aws] terraform:       + dns_name                                                     = (known after apply)
08:33:17.767 STDOUT [aws] terraform:       + drop_invalid_header_fields                                   = true
08:33:17.767 STDOUT [aws] terraform:       + enable_deletion_protection                                   = false
08:33:17.767 STDOUT [aws] terraform:       + enable_http2                                                 = true
08:33:17.767 STDOUT [aws] terraform:       + enable_tls_version_and_cipher_suite_headers                  = false
08:33:17.767 STDOUT [aws] terraform:       + enable_waf_fail_open                                         = false
08:33:17.767 STDOUT [aws] terraform:       + enable_xff_client_port                                       = false
08:33:17.767 STDOUT [aws] terraform:       + enable_zonal_shift                                           = false
08:33:17.767 STDOUT [aws] terraform:       + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
08:33:17.767 STDOUT [aws] terraform:       + id                                                           = (known after apply)
08:33:17.767 STDOUT [aws] terraform:       + idle_timeout                                                 = 60
08:33:17.768 STDOUT [aws] terraform:       + internal                                                     = (known after apply)
08:33:17.768 STDOUT [aws] terraform:       + ip_address_type                                              = (known after apply)
08:33:17.768 STDOUT [aws] terraform:       + load_balancer_type                                           = "application"
08:33:17.768 STDOUT [aws] terraform:       + name                                                         = "ethan-dev-alb-apne1"
08:33:17.768 STDOUT [aws] terraform:       + name_prefix                                                  = (known after apply)
08:33:17.768 STDOUT [aws] terraform:       + preserve_host_header                                         = false
08:33:17.768 STDOUT [aws] terraform:       + region                                                       = "ap-northeast-1"
08:33:17.768 STDOUT [aws] terraform:       + security_groups                                              = (known after apply)
08:33:17.768 STDOUT [aws] terraform:       + subnets                                                      = (known after apply)
08:33:17.768 STDOUT [aws] terraform:       + tags_all                                                     = (known after apply)
08:33:17.768 STDOUT [aws] terraform:       + vpc_id                                                       = (known after apply)
08:33:17.768 STDOUT [aws] terraform:       + xff_header_processing_mode                                   = "append"
08:33:17.768 STDOUT [aws] terraform:       + zone_id                                                      = (known after apply)
08:33:17.769 STDOUT [aws] terraform:       + subnet_mapping (known after apply)
08:33:17.769 STDOUT [aws] terraform:     }
08:33:17.769 STDOUT [aws] terraform:   # module.openmetadata_lb.aws_lb_listener.from_https will be created
08:33:17.769 STDOUT [aws] terraform:   + resource "aws_lb_listener" "from_https" {
08:33:17.769 STDOUT [aws] terraform:       + arn                                                                   = (known after apply)
08:33:17.769 STDOUT [aws] terraform:       + certificate_arn                                                       = "arn:aws:acm:ap-northeast-1:000000000000:certificate/mock"
08:33:17.769 STDOUT [aws] terraform:       + id                                                                    = (known after apply)
08:33:17.769 STDOUT [aws] terraform:       + load_balancer_arn                                                     = (known after apply)
08:33:17.769 STDOUT [aws] terraform:       + port                                                                  = 443
08:33:17.769 STDOUT [aws] terraform:       + protocol                                                              = "HTTPS"
08:33:17.769 STDOUT [aws] terraform:       + region                                                                = "ap-northeast-1"
08:33:17.769 STDOUT [aws] terraform:       + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
08:33:17.769 STDOUT [aws] terraform:       + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
08:33:17.770 STDOUT [aws] terraform:       + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
08:33:17.770 STDOUT [aws] terraform:       + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
08:33:17.770 STDOUT [aws] terraform:       + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
08:33:17.770 STDOUT [aws] terraform:       + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
08:33:17.770 STDOUT [aws] terraform:       + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
08:33:17.770 STDOUT [aws] terraform:       + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
08:33:17.770 STDOUT [aws] terraform:       + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
08:33:17.770 STDOUT [aws] terraform:       + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
08:33:17.770 STDOUT [aws] terraform:       + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
08:33:17.770 STDOUT [aws] terraform:       + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
08:33:17.770 STDOUT [aws] terraform:       + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
08:33:17.770 STDOUT [aws] terraform:       + routing_http_response_access_control_max_age_header_value             = (known after apply)
08:33:17.771 STDOUT [aws] terraform:       + routing_http_response_content_security_policy_header_value            = (known after apply)
08:33:17.771 STDOUT [aws] terraform:       + routing_http_response_server_enabled                                  = (known after apply)
08:33:17.771 STDOUT [aws] terraform:       + routing_http_response_strict_transport_security_header_value          = (known after apply)
08:33:17.771 STDOUT [aws] terraform:       + routing_http_response_x_content_type_options_header_value             = (known after apply)
08:33:17.771 STDOUT [aws] terraform:       + routing_http_response_x_frame_options_header_value                    = (known after apply)
08:33:17.771 STDOUT [aws] terraform:       + ssl_policy                                                            = (known after apply)
08:33:17.771 STDOUT [aws] terraform:       + tags_all                                                              = (known after apply)
08:33:17.771 STDOUT [aws] terraform:       + tcp_idle_timeout_seconds                                              = (known after apply)
08:33:17.771 STDOUT [aws] terraform:       + default_action {
08:33:17.771 STDOUT [aws] terraform:           + order            = (known after apply)
08:33:17.771 STDOUT [aws] terraform:           + target_group_arn = (known after apply)
08:33:17.771 STDOUT [aws] terraform:           + type             = "forward"
08:33:17.771 STDOUT [aws] terraform:         }
08:33:17.771 STDOUT [aws] terraform:       + mutual_authentication (known after apply)
08:33:17.771 STDOUT [aws] terraform:     }
08:33:17.772 STDOUT [aws] terraform:   # module.openmetadata_lb.aws_lb_target_group.to_openmetadata will be created
08:33:17.772 STDOUT [aws] terraform:   + resource "aws_lb_target_group" "to_openmetadata" {
08:33:17.772 STDOUT [aws] terraform:       + arn                                = (known after apply)
08:33:17.772 STDOUT [aws] terraform:       + arn_suffix                         = (known after apply)
08:33:17.772 STDOUT [aws] terraform:       + connection_termination             = (known after apply)
08:33:17.772 STDOUT [aws] terraform:       + deregistration_delay               = "300"
08:33:17.772 STDOUT [aws] terraform:       + id                                 = (known after apply)
08:33:17.772 STDOUT [aws] terraform:       + ip_address_type                    = (known after apply)
08:33:17.772 STDOUT [aws] terraform:       + lambda_multi_value_headers_enabled = false
08:33:17.772 STDOUT [aws] terraform:       + load_balancer_arns                 = (known after apply)
08:33:17.772 STDOUT [aws] terraform:       + load_balancing_algorithm_type      = "least_outstanding_requests"
08:33:17.772 STDOUT [aws] terraform:       + load_balancing_anomaly_mitigation  = (known after apply)
08:33:17.772 STDOUT [aws] terraform:       + load_balancing_cross_zone_enabled  = (known after apply)
08:33:17.772 STDOUT [aws] terraform:       + name                               = "openmetadata-tg"
08:33:17.772 STDOUT [aws] terraform:       + name_prefix                        = (known after apply)
08:33:17.773 STDOUT [aws] terraform:       + port                               = 8585
08:33:17.773 STDOUT [aws] terraform:       + preserve_client_ip                 = (known after apply)
08:33:17.773 STDOUT [aws] terraform:       + protocol                           = "HTTP"
08:33:17.773 STDOUT [aws] terraform:       + protocol_version                   = (known after apply)
08:33:17.773 STDOUT [aws] terraform:       + proxy_protocol_v2                  = false
08:33:17.773 STDOUT [aws] terraform:       + region                             = "ap-northeast-1"
08:33:17.773 STDOUT [aws] terraform:       + slow_start                         = 0
08:33:17.773 STDOUT [aws] terraform:       + tags_all                           = (known after apply)
08:33:17.773 STDOUT [aws] terraform:       + target_type                        = "ip"
08:33:17.773 STDOUT [aws] terraform:       + vpc_id                             = (known after apply)
08:33:17.773 STDOUT [aws] terraform:       + health_check (known after apply)
08:33:17.773 STDOUT [aws] terraform:       + stickiness {
08:33:17.773 STDOUT [aws] terraform:           + cookie_duration = 86400
08:33:17.773 STDOUT [aws] terraform:           + enabled         = true
08:33:17.773 STDOUT [aws] terraform:           + type            = "lb_cookie"
08:33:17.773 STDOUT [aws] terraform:         }
08:33:17.773 STDOUT [aws] terraform:       + target_failover (known after apply)
08:33:17.773 STDOUT [aws] terraform:       + target_group_health (known after apply)
08:33:17.774 STDOUT [aws] terraform:       + target_health_state (known after apply)
08:33:17.774 STDOUT [aws] terraform:     }
08:33:17.774 STDOUT [aws] terraform:   # module.openmetadata_lb.aws_route53_record.alb_a_record will be created
08:33:17.774 STDOUT [aws] terraform:   + resource "aws_route53_record" "alb_a_record" {
08:33:17.774 STDOUT [aws] terraform:       + allow_overwrite = (known after apply)
08:33:17.774 STDOUT [aws] terraform:       + fqdn            = (known after apply)
08:33:17.774 STDOUT [aws] terraform:       + id              = (known after apply)
08:33:17.774 STDOUT [aws] terraform:       + name            = "ethan-example.com"
08:33:17.774 STDOUT [aws] terraform:       + type            = "A"
08:33:17.774 STDOUT [aws] terraform:       + zone_id         = "Z111111111111"
08:33:17.774 STDOUT [aws] terraform:       + alias {
08:33:17.774 STDOUT [aws] terraform:           + evaluate_target_health = true
08:33:17.774 STDOUT [aws] terraform:           + name                   = (known after apply)
08:33:17.774 STDOUT [aws] terraform:           + zone_id                = (known after apply)
08:33:17.774 STDOUT [aws] terraform:         }
08:33:17.774 STDOUT [aws] terraform:     }
08:33:17.774 STDOUT [aws] terraform:   # module.openmetadata_s3.aws_s3_bucket.this will be created
08:33:17.774 STDOUT [aws] terraform:   + resource "aws_s3_bucket" "this" {
08:33:17.774 STDOUT [aws] terraform:       + acceleration_status         = (known after apply)
08:33:17.774 STDOUT [aws] terraform:       + acl                         = (known after apply)
08:33:17.775 STDOUT [aws] terraform:       + arn                         = (known after apply)
08:33:17.775 STDOUT [aws] terraform:       + bucket                      = "ethan-dev-s3-apne1-docker-envfile"
08:33:17.775 STDOUT [aws] terraform:       + bucket_domain_name          = (known after apply)
08:33:17.775 STDOUT [aws] terraform:       + bucket_prefix               = (known after apply)
08:33:17.775 STDOUT [aws] terraform:       + bucket_region               = (known after apply)
08:33:17.775 STDOUT [aws] terraform:       + bucket_regional_domain_name = (known after apply)
08:33:17.775 STDOUT [aws] terraform:       + force_destroy               = false
08:33:17.775 STDOUT [aws] terraform:       + hosted_zone_id              = (known after apply)
08:33:17.775 STDOUT [aws] terraform:       + id                          = (known after apply)
08:33:17.775 STDOUT [aws] terraform:       + object_lock_enabled         = (known after apply)
08:33:17.775 STDOUT [aws] terraform:       + policy                      = (known after apply)
08:33:17.775 STDOUT [aws] terraform:       + region                      = "ap-northeast-1"
08:33:17.775 STDOUT [aws] terraform:       + request_payer               = (known after apply)
08:33:17.775 STDOUT [aws] terraform:       + tags                        = {
08:33:17.775 STDOUT [aws] terraform:           + "Name" = "ethan-dev-s3-apne1-docker-envfile"
08:33:17.775 STDOUT [aws] terraform:         }
08:33:17.775 STDOUT [aws] terraform:       + tags_all                    = {
08:33:17.776 STDOUT [aws] terraform:           + "Name" = "ethan-dev-s3-apne1-docker-envfile"
08:33:17.776 STDOUT [aws] terraform:         }
08:33:17.776 STDOUT [aws] terraform:       + website_domain              = (known after apply)
08:33:17.776 STDOUT [aws] terraform:       + website_endpoint            = (known after apply)
08:33:17.776 STDOUT [aws] terraform:       + cors_rule (known after apply)
08:33:17.776 STDOUT [aws] terraform:       + grant (known after apply)
08:33:17.776 STDOUT [aws] terraform:       + lifecycle_rule (known after apply)
08:33:17.776 STDOUT [aws] terraform:       + logging (known after apply)
08:33:17.776 STDOUT [aws] terraform:       + object_lock_configuration (known after apply)
08:33:17.776 STDOUT [aws] terraform:       + replication_configuration (known after apply)
08:33:17.776 STDOUT [aws] terraform:       + server_side_encryption_configuration (known after apply)
08:33:17.776 STDOUT [aws] terraform:       + versioning (known after apply)
08:33:17.776 STDOUT [aws] terraform:       + website (known after apply)
08:33:17.776 STDOUT [aws] terraform:     }
08:33:17.776 STDOUT [aws] terraform:   # module.openmetadata_s3.aws_s3_bucket_policy.this will be created
08:33:17.776 STDOUT [aws] terraform:   + resource "aws_s3_bucket_policy" "this" {
08:33:17.776 STDOUT [aws] terraform:       + bucket = (known after apply)
08:33:17.776 STDOUT [aws] terraform:       + id     = (known after apply)
08:33:17.776 STDOUT [aws] terraform:       + policy = (known after apply)
08:33:17.776 STDOUT [aws] terraform:       + region = "ap-northeast-1"
08:33:17.777 STDOUT [aws] terraform:     }
08:33:17.777 STDOUT [aws] terraform:   # module.openmetadata_s3.aws_s3_bucket_public_access_block.this will be created
08:33:17.777 STDOUT [aws] terraform:   + resource "aws_s3_bucket_public_access_block" "this" {
08:33:17.777 STDOUT [aws] terraform:       + block_public_acls       = true
08:33:17.777 STDOUT [aws] terraform:       + block_public_policy     = true
08:33:17.777 STDOUT [aws] terraform:       + bucket                  = (known after apply)
08:33:17.777 STDOUT [aws] terraform:       + id                      = (known after apply)
08:33:17.777 STDOUT [aws] terraform:       + ignore_public_acls      = true
08:33:17.777 STDOUT [aws] terraform:       + region                  = "ap-northeast-1"
08:33:17.777 STDOUT [aws] terraform:       + restrict_public_buckets = true
08:33:17.777 STDOUT [aws] terraform:     }
08:33:17.777 STDOUT [aws] terraform:   # module.openmetadata_s3.aws_s3_bucket_server_side_encryption_configuration.this will be created
08:33:17.777 STDOUT [aws] terraform:   + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
08:33:17.777 STDOUT [aws] terraform:       + bucket = (known after apply)
08:33:17.777 STDOUT [aws] terraform:       + id     = (known after apply)
08:33:17.777 STDOUT [aws] terraform:       + region = "ap-northeast-1"
08:33:17.777 STDOUT [aws] terraform:       + rule {
08:33:17.777 STDOUT [aws] terraform:           + apply_server_side_encryption_by_default {
08:33:17.777 STDOUT [aws] terraform:               + kms_master_key_id = (known after apply)
08:33:17.777 STDOUT [aws] terraform:               + sse_algorithm     = "aws:kms"
08:33:17.778 STDOUT [aws] terraform:             }
08:33:17.778 STDOUT [aws] terraform:         }
08:33:17.778 STDOUT [aws] terraform:     }
08:33:17.778 STDOUT [aws] terraform:   # module.openmetadata_s3.aws_s3_bucket_versioning.this will be created
08:33:17.778 STDOUT [aws] terraform:   + resource "aws_s3_bucket_versioning" "this" {
08:33:17.778 STDOUT [aws] terraform:       + bucket = (known after apply)
08:33:17.778 STDOUT [aws] terraform:       + id     = (known after apply)
08:33:17.778 STDOUT [aws] terraform:       + region = "ap-northeast-1"
08:33:17.778 STDOUT [aws] terraform:       + versioning_configuration {
08:33:17.778 STDOUT [aws] terraform:           + mfa_delete = (known after apply)
08:33:17.778 STDOUT [aws] terraform:           + status     = "Enabled"
08:33:17.778 STDOUT [aws] terraform:         }
08:33:17.778 STDOUT [aws] terraform:     }
08:33:17.778 STDOUT [aws] terraform:   # module.openmetadata_s3.terraform_data.copy_docker_environments will be created
08:33:17.778 STDOUT [aws] terraform:   + resource "terraform_data" "copy_docker_environments" {
08:33:17.778 STDOUT [aws] terraform:       + id               = (known after apply)
08:33:17.778 STDOUT [aws] terraform:       + triggers_replace = [
08:33:17.778 STDOUT [aws] terraform:           + (known after apply),
08:33:17.778 STDOUT [aws] terraform:           + "3a92284b199950bde811c42a9dbf742b0622d3d70b59ab164a74db55e4de5b5e",
08:33:17.778 STDOUT [aws] terraform:           + "dea6d017571d8236509550f0186053222ac0478072605cf61b9a400823558ad4",
08:33:17.778 STDOUT [aws] terraform:           + "dea6d017571d8236509550f0186053222ac0478072605cf61b9a400823558ad4",
08:33:17.779 STDOUT [aws] terraform:           + "fb3d53fd55bd99861e690d6e6daa2cc288e644c34ff31307a7a64ec0addc73af",
08:33:17.779 STDOUT [aws] terraform:         ]
08:33:17.779 STDOUT [aws] terraform:     }
08:33:17.779 STDOUT [aws] terraform:   # module.openmetadata_secretmanager.aws_secretsmanager_secret.aurora will be created
08:33:17.779 STDOUT [aws] terraform:   + resource "aws_secretsmanager_secret" "aurora" {
08:33:17.779 STDOUT [aws] terraform:       + arn                            = (known after apply)
08:33:17.779 STDOUT [aws] terraform:       + force_overwrite_replica_secret = false
08:33:17.779 STDOUT [aws] terraform:       + id                             = (known after apply)
08:33:17.779 STDOUT [aws] terraform:       + name                           = "ethan-dev-secret-apne1-aurora"
08:33:17.779 STDOUT [aws] terraform:       + name_prefix                    = (known after apply)
08:33:17.779 STDOUT [aws] terraform:       + policy                         = (known after apply)
08:33:17.779 STDOUT [aws] terraform:       + recovery_window_in_days        = 30
08:33:17.779 STDOUT [aws] terraform:       + region                         = "ap-northeast-1"
08:33:17.779 STDOUT [aws] terraform:       + tags                           = {
08:33:17.779 STDOUT [aws] terraform:           + "Name" = "ethan-dev-secret-apne1-aurora"
08:33:17.779 STDOUT [aws] terraform:         }
08:33:17.779 STDOUT [aws] terraform:       + tags_all                       = {
08:33:17.779 STDOUT [aws] terraform:           + "Name" = "ethan-dev-secret-apne1-aurora"
08:33:17.780 STDOUT [aws] terraform:         }
08:33:17.780 STDOUT [aws] terraform:         # (1 unchanged attribute hidden)
08:33:17.780 STDOUT [aws] terraform:       + replica (known after apply)
08:33:17.780 STDOUT [aws] terraform:     }
08:33:17.780 STDOUT [aws] terraform:   # module.openmetadata_secretmanager.aws_secretsmanager_secret.openmetadata will be created
08:33:17.780 STDOUT [aws] terraform:   + resource "aws_secretsmanager_secret" "openmetadata" {
08:33:17.780 STDOUT [aws] terraform:       + arn                            = (known after apply)
08:33:17.780 STDOUT [aws] terraform:       + description                    = "List of initial user passwords required when building OpenMetadata"
08:33:17.780 STDOUT [aws] terraform:       + force_overwrite_replica_secret = false
08:33:17.780 STDOUT [aws] terraform:       + id                             = (known after apply)
08:33:17.780 STDOUT [aws] terraform:       + name                           = "ethan-dev-secret-apne1-openmetadata"
08:33:17.780 STDOUT [aws] terraform:       + name_prefix                    = (known after apply)
08:33:17.780 STDOUT [aws] terraform:       + policy                         = (known after apply)
08:33:17.780 STDOUT [aws] terraform:       + recovery_window_in_days        = 30
08:33:17.780 STDOUT [aws] terraform:       + region                         = "ap-northeast-1"
08:33:17.780 STDOUT [aws] terraform:       + tags                           = {
08:33:17.780 STDOUT [aws] terraform:           + "Name" = "ethan-dev-secret-apne1-openmetadata"
08:33:17.780 STDOUT [aws] terraform:         }
08:33:17.780 STDOUT [aws] terraform:       + tags_all                       = {
08:33:17.781 STDOUT [aws] terraform:           + "Name" = "ethan-dev-secret-apne1-openmetadata"
08:33:17.781 STDOUT [aws] terraform:         }
08:33:17.781 STDOUT [aws] terraform:       + replica (known after apply)
08:33:17.781 STDOUT [aws] terraform:     }
08:33:17.781 STDOUT [aws] terraform:   # module.openmetadata_secretmanager.aws_secretsmanager_secret_version.aurora will be created
08:33:17.781 STDOUT [aws] terraform:   + resource "aws_secretsmanager_secret_version" "aurora" {
08:33:17.781 STDOUT [aws] terraform:       + arn                  = (known after apply)
08:33:17.781 STDOUT [aws] terraform:       + has_secret_string_wo = (known after apply)
08:33:17.781 STDOUT [aws] terraform:       + id                   = (known after apply)
08:33:17.781 STDOUT [aws] terraform:       + region               = "ap-northeast-1"
08:33:17.781 STDOUT [aws] terraform:       + secret_id            = (known after apply)
08:33:17.781 STDOUT [aws] terraform:       + secret_string        = (sensitive value)
08:33:17.781 STDOUT [aws] terraform:       + secret_string_wo     = (write-only attribute)
08:33:17.781 STDOUT [aws] terraform:       + version_id           = (known after apply)
08:33:17.781 STDOUT [aws] terraform:       + version_stages       = (known after apply)
08:33:17.781 STDOUT [aws] terraform:     }
08:33:17.781 STDOUT [aws] terraform:   # module.openmetadata_secretmanager.aws_secretsmanager_secret_version.openmetadata will be created
08:33:17.781 STDOUT [aws] terraform:   + resource "aws_secretsmanager_secret_version" "openmetadata" {
08:33:17.781 STDOUT [aws] terraform:       + arn                  = (known after apply)
08:33:17.782 STDOUT [aws] terraform:       + has_secret_string_wo = (known after apply)
08:33:17.782 STDOUT [aws] terraform:       + id                   = (known after apply)
08:33:17.782 STDOUT [aws] terraform:       + region               = "ap-northeast-1"
08:33:17.782 STDOUT [aws] terraform:       + secret_id            = (known after apply)
08:33:17.782 STDOUT [aws] terraform:       + secret_string        = (sensitive value)
08:33:17.782 STDOUT [aws] terraform:       + secret_string_wo     = (write-only attribute)
08:33:17.782 STDOUT [aws] terraform:       + version_id           = (known after apply)
08:33:17.782 STDOUT [aws] terraform:       + version_stages       = (known after apply)
08:33:17.782 STDOUT [aws] terraform:     }
08:33:17.782 STDOUT [aws] terraform:   # module.openmetadata_secretmanager.random_password.airflow_admin_password will be created
08:33:17.782 STDOUT [aws] terraform:   + resource "random_password" "airflow_admin_password" {
08:33:17.782 STDOUT [aws] terraform:       + bcrypt_hash = (sensitive value)
08:33:17.782 STDOUT [aws] terraform:       + id          = (known after apply)
08:33:17.782 STDOUT [aws] terraform:       + length      = 16
08:33:17.782 STDOUT [aws] terraform:       + lower       = true
08:33:17.782 STDOUT [aws] terraform:       + min_lower   = 0
08:33:17.782 STDOUT [aws] terraform:       + min_numeric = 0
08:33:17.782 STDOUT [aws] terraform:       + min_special = 0
08:33:17.782 STDOUT [aws] terraform:       + min_upper   = 0
08:33:17.782 STDOUT [aws] terraform:       + number      = true
08:33:17.783 STDOUT [aws] terraform:       + numeric     = true
08:33:17.783 STDOUT [aws] terraform:       + result      = (sensitive value)
08:33:17.783 STDOUT [aws] terraform:       + special     = false
08:33:17.783 STDOUT [aws] terraform:       + upper       = true
08:33:17.783 STDOUT [aws] terraform:     }
08:33:17.783 STDOUT [aws] terraform:   # module.openmetadata_secretmanager.random_password.airflow_db_password will be created
08:33:17.783 STDOUT [aws] terraform:   + resource "random_password" "airflow_db_password" {
08:33:17.783 STDOUT [aws] terraform:       + bcrypt_hash = (sensitive value)
08:33:17.783 STDOUT [aws] terraform:       + id          = (known after apply)
08:33:17.783 STDOUT [aws] terraform:       + length      = 16
08:33:17.783 STDOUT [aws] terraform:       + lower       = true
08:33:17.783 STDOUT [aws] terraform:       + min_lower   = 0
08:33:17.783 STDOUT [aws] terraform:       + min_numeric = 0
08:33:17.783 STDOUT [aws] terraform:       + min_special = 0
08:33:17.783 STDOUT [aws] terraform:       + min_upper   = 0
08:33:17.783 STDOUT [aws] terraform:       + number      = true
08:33:17.783 STDOUT [aws] terraform:       + numeric     = true
08:33:17.783 STDOUT [aws] terraform:       + result      = (sensitive value)
08:33:17.783 STDOUT [aws] terraform:       + special     = false
08:33:17.783 STDOUT [aws] terraform:       + upper       = true
08:33:17.783 STDOUT [aws] terraform:     }
08:33:17.783 STDOUT [aws] terraform:   # module.openmetadata_secretmanager.random_password.aurora_password will be created
08:33:17.784 STDOUT [aws] terraform:   + resource "random_password" "aurora_password" {
08:33:17.784 STDOUT [aws] terraform:       + bcrypt_hash = (sensitive value)
08:33:17.784 STDOUT [aws] terraform:       + id          = (known after apply)
08:33:17.784 STDOUT [aws] terraform:       + length      = 16
08:33:17.784 STDOUT [aws] terraform:       + lower       = true
08:33:17.784 STDOUT [aws] terraform:       + min_lower   = 0
08:33:17.784 STDOUT [aws] terraform:       + min_numeric = 0
08:33:17.784 STDOUT [aws] terraform:       + min_special = 0
08:33:17.784 STDOUT [aws] terraform:       + min_upper   = 0
08:33:17.784 STDOUT [aws] terraform:       + number      = true
08:33:17.784 STDOUT [aws] terraform:       + numeric     = true
08:33:17.784 STDOUT [aws] terraform:       + result      = (sensitive value)
08:33:17.784 STDOUT [aws] terraform:       + special     = false
08:33:17.784 STDOUT [aws] terraform:       + upper       = true
08:33:17.784 STDOUT [aws] terraform:     }
08:33:17.784 STDOUT [aws] terraform:   # module.openmetadata_secretmanager.random_password.elasticsearch_password will be created
08:33:17.784 STDOUT [aws] terraform:   + resource "random_password" "elasticsearch_password" {
08:33:17.784 STDOUT [aws] terraform:       + bcrypt_hash = (sensitive value)
08:33:17.784 STDOUT [aws] terraform:       + id          = (known after apply)
08:33:17.784 STDOUT [aws] terraform:       + length      = 16
08:33:17.784 STDOUT [aws] terraform:       + lower       = true
08:33:17.784 STDOUT [aws] terraform:       + min_lower   = 0
08:33:17.785 STDOUT [aws] terraform:       + min_numeric = 0
08:33:17.785 STDOUT [aws] terraform:       + min_special = 0
08:33:17.785 STDOUT [aws] terraform:       + min_upper   = 0
08:33:17.785 STDOUT [aws] terraform:       + number      = true
08:33:17.785 STDOUT [aws] terraform:       + numeric     = true
08:33:17.785 STDOUT [aws] terraform:       + result      = (sensitive value)
08:33:17.785 STDOUT [aws] terraform:       + special     = false
08:33:17.785 STDOUT [aws] terraform:       + upper       = true
08:33:17.785 STDOUT [aws] terraform:     }
08:33:17.785 STDOUT [aws] terraform:   # module.openmetadata_secretmanager.random_password.openmetadata_db_password will be created
08:33:17.785 STDOUT [aws] terraform:   + resource "random_password" "openmetadata_db_password" {
08:33:17.785 STDOUT [aws] terraform:       + bcrypt_hash = (sensitive value)
08:33:17.785 STDOUT [aws] terraform:       + id          = (known after apply)
08:33:17.785 STDOUT [aws] terraform:       + length      = 16
08:33:17.785 STDOUT [aws] terraform:       + lower       = true
08:33:17.785 STDOUT [aws] terraform:       + min_lower   = 0
08:33:17.785 STDOUT [aws] terraform:       + min_numeric = 0
08:33:17.785 STDOUT [aws] terraform:       + min_special = 0
08:33:17.785 STDOUT [aws] terraform:       + min_upper   = 0
08:33:17.785 STDOUT [aws] terraform:       + number      = true
08:33:17.785 STDOUT [aws] terraform:       + numeric     = true
08:33:17.785 STDOUT [aws] terraform:       + result      = (sensitive value)
08:33:17.785 STDOUT [aws] terraform:       + special     = false
08:33:17.786 STDOUT [aws] terraform:       + upper       = true
08:33:17.786 STDOUT [aws] terraform:     }
08:33:17.786 STDOUT [aws] terraform:   # module.openmetadata_security_group.aws_ec2_managed_prefix_list.allowed_ip_list will be created
08:33:17.786 STDOUT [aws] terraform:   + resource "aws_ec2_managed_prefix_list" "allowed_ip_list" {
08:33:17.786 STDOUT [aws] terraform:       + address_family = "IPv4"
08:33:17.786 STDOUT [aws] terraform:       + arn            = (known after apply)
08:33:17.786 STDOUT [aws] terraform:       + id             = (known after apply)
08:33:17.786 STDOUT [aws] terraform:       + max_entries    = 30
08:33:17.786 STDOUT [aws] terraform:       + name           = "allowed_ip_list"
08:33:17.786 STDOUT [aws] terraform:       + owner_id       = (known after apply)
08:33:17.786 STDOUT [aws] terraform:       + region         = "ap-northeast-1"
08:33:17.786 STDOUT [aws] terraform:       + tags_all       = (known after apply)
08:33:17.786 STDOUT [aws] terraform:       + version        = (known after apply)
08:33:17.786 STDOUT [aws] terraform:       + entry {
08:33:17.786 STDOUT [aws] terraform:           + cidr        = "192.0.2.0/24"
08:33:17.786 STDOUT [aws] terraform:             # (1 unchanged attribute hidden)
08:33:17.786 STDOUT [aws] terraform:         }
08:33:17.786 STDOUT [aws] terraform:     }
08:33:17.786 STDOUT [aws] terraform:   # module.openmetadata_security_group.aws_security_group.alb_sg will be created
08:33:17.786 STDOUT [aws] terraform:   + resource "aws_security_group" "alb_sg" {
08:33:17.786 STDOUT [aws] terraform:       + arn                    = (known after apply)
08:33:17.787 STDOUT [aws] terraform:       + description            = "Managed by Terraform"
08:33:17.787 STDOUT [aws] terraform:       + egress                 = [
08:33:17.787 STDOUT [aws] terraform:           + {
08:33:17.787 STDOUT [aws] terraform:               + cidr_blocks      = [
08:33:17.787 STDOUT [aws] terraform:                   + "0.0.0.0/0",
08:33:17.787 STDOUT [aws] terraform:                 ]
08:33:17.787 STDOUT [aws] terraform:               + from_port        = 0
08:33:17.787 STDOUT [aws] terraform:               + ipv6_cidr_blocks = []
08:33:17.787 STDOUT [aws] terraform:               + prefix_list_ids  = []
08:33:17.787 STDOUT [aws] terraform:               + protocol         = "-1"
08:33:17.787 STDOUT [aws] terraform:               + security_groups  = []
08:33:17.787 STDOUT [aws] terraform:               + self             = false
08:33:17.787 STDOUT [aws] terraform:               + to_port          = 0
08:33:17.787 STDOUT [aws] terraform:                 # (1 unchanged attribute hidden)
08:33:17.787 STDOUT [aws] terraform:             },
08:33:17.787 STDOUT [aws] terraform:         ]
08:33:17.787 STDOUT [aws] terraform:       + id                     = (known after apply)
08:33:17.787 STDOUT [aws] terraform:       + ingress                = [
08:33:17.787 STDOUT [aws] terraform:           + {
08:33:17.787 STDOUT [aws] terraform:               + cidr_blocks      = []
08:33:17.787 STDOUT [aws] terraform:               + from_port        = 443
08:33:17.787 STDOUT [aws] terraform:               + ipv6_cidr_blocks = []
08:33:17.788 STDOUT [aws] terraform:               + prefix_list_ids  = (known after apply)
08:33:17.788 STDOUT [aws] terraform:               + protocol         = "tcp"
08:33:17.788 STDOUT [aws] terraform:               + security_groups  = []
08:33:17.788 STDOUT [aws] terraform:               + self             = false
08:33:17.788 STDOUT [aws] terraform:               + to_port          = 443
08:33:17.788 STDOUT [aws] terraform:                 # (1 unchanged attribute hidden)
08:33:17.788 STDOUT [aws] terraform:             },
08:33:17.788 STDOUT [aws] terraform:         ]
08:33:17.788 STDOUT [aws] terraform:       + name                   = (known after apply)
08:33:17.788 STDOUT [aws] terraform:       + name_prefix            = (known after apply)
08:33:17.788 STDOUT [aws] terraform:       + owner_id               = (known after apply)
08:33:17.788 STDOUT [aws] terraform:       + region                 = "ap-northeast-1"
08:33:17.788 STDOUT [aws] terraform:       + revoke_rules_on_delete = false
08:33:17.788 STDOUT [aws] terraform:       + tags                   = {
08:33:17.788 STDOUT [aws] terraform:           + "Name" = "ethan-dev-sg-apne1-alb"
08:33:17.788 STDOUT [aws] terraform:         }
08:33:17.788 STDOUT [aws] terraform:       + tags_all               = {
08:33:17.788 STDOUT [aws] terraform:           + "Name" = "ethan-dev-sg-apne1-alb"
08:33:17.788 STDOUT [aws] terraform:         }
08:33:17.788 STDOUT [aws] terraform:       + vpc_id                 = (known after apply)
08:33:17.788 STDOUT [aws] terraform:     }
08:33:17.789 STDOUT [aws] terraform:   # module.openmetadata_security_group.aws_security_group.aurora_sg will be created
08:33:17.789 STDOUT [aws] terraform:   + resource "aws_security_group" "aurora_sg" {
08:33:17.789 STDOUT [aws] terraform:       + arn                    = (known after apply)
08:33:17.789 STDOUT [aws] terraform:       + description            = "Managed by Terraform"
08:33:17.789 STDOUT [aws] terraform:       + egress                 = [
08:33:17.789 STDOUT [aws] terraform:           + {
08:33:17.789 STDOUT [aws] terraform:               + cidr_blocks      = [
08:33:17.789 STDOUT [aws] terraform:                   + "0.0.0.0/0",
08:33:17.789 STDOUT [aws] terraform:                 ]
08:33:17.789 STDOUT [aws] terraform:               + from_port        = 0
08:33:17.789 STDOUT [aws] terraform:               + ipv6_cidr_blocks = []
08:33:17.789 STDOUT [aws] terraform:               + prefix_list_ids  = []
08:33:17.789 STDOUT [aws] terraform:               + protocol         = "-1"
08:33:17.789 STDOUT [aws] terraform:               + security_groups  = []
08:33:17.789 STDOUT [aws] terraform:               + self             = false
08:33:17.789 STDOUT [aws] terraform:               + to_port          = 0
08:33:17.789 STDOUT [aws] terraform:                 # (1 unchanged attribute hidden)
08:33:17.789 STDOUT [aws] terraform:             },
08:33:17.789 STDOUT [aws] terraform:         ]
08:33:17.789 STDOUT [aws] terraform:       + id                     = (known after apply)
08:33:17.789 STDOUT [aws] terraform:       + ingress                = [
08:33:17.790 STDOUT [aws] terraform:           + {
08:33:17.790 STDOUT [aws] terraform:               + cidr_blocks      = []
08:33:17.790 STDOUT [aws] terraform:               + from_port        = 5432
08:33:17.790 STDOUT [aws] terraform:               + ipv6_cidr_blocks = []
08:33:17.790 STDOUT [aws] terraform:               + prefix_list_ids  = []
08:33:17.790 STDOUT [aws] terraform:               + protocol         = "tcp"
08:33:17.790 STDOUT [aws] terraform:               + security_groups  = (known after apply)
08:33:17.790 STDOUT [aws] terraform:               + self             = false
08:33:17.790 STDOUT [aws] terraform:               + to_port          = 5432
08:33:17.790 STDOUT [aws] terraform:                 # (1 unchanged attribute hidden)
08:33:17.790 STDOUT [aws] terraform:             },
08:33:17.790 STDOUT [aws] terraform:         ]
08:33:17.790 STDOUT [aws] terraform:       + name                   = (known after apply)
08:33:17.790 STDOUT [aws] terraform:       + name_prefix            = (known after apply)
08:33:17.790 STDOUT [aws] terraform:       + owner_id               = (known after apply)
08:33:17.790 STDOUT [aws] terraform:       + region                 = "ap-northeast-1"
08:33:17.790 STDOUT [aws] terraform:       + revoke_rules_on_delete = false
08:33:17.790 STDOUT [aws] terraform:       + tags                   = {
08:33:17.790 STDOUT [aws] terraform:           + "Name" = "ethan-dev-sg-apne1-aurora"
08:33:17.790 STDOUT [aws] terraform:         }
08:33:17.791 STDOUT [aws] terraform:       + tags_all               = {
08:33:17.791 STDOUT [aws] terraform:           + "Name" = "ethan-dev-sg-apne1-aurora"
08:33:17.791 STDOUT [aws] terraform:         }
08:33:17.791 STDOUT [aws] terraform:       + vpc_id                 = (known after apply)
08:33:17.791 STDOUT [aws] terraform:     }
08:33:17.791 STDOUT [aws] terraform:   # module.openmetadata_security_group.aws_security_group.ecs_sg will be created
08:33:17.791 STDOUT [aws] terraform:   + resource "aws_security_group" "ecs_sg" {
08:33:17.791 STDOUT [aws] terraform:       + arn                    = (known after apply)
08:33:17.791 STDOUT [aws] terraform:       + description            = "Managed by Terraform"
08:33:17.791 STDOUT [aws] terraform:       + egress                 = [
08:33:17.791 STDOUT [aws] terraform:           + {
08:33:17.791 STDOUT [aws] terraform:               + cidr_blocks      = [
08:33:17.791 STDOUT [aws] terraform:                   + "0.0.0.0/0",
08:33:17.791 STDOUT [aws] terraform:                 ]
08:33:17.791 STDOUT [aws] terraform:               + from_port        = 0
08:33:17.791 STDOUT [aws] terraform:               + ipv6_cidr_blocks = []
08:33:17.791 STDOUT [aws] terraform:               + prefix_list_ids  = []
08:33:17.791 STDOUT [aws] terraform:               + protocol         = "-1"
08:33:17.791 STDOUT [aws] terraform:               + security_groups  = []
08:33:17.791 STDOUT [aws] terraform:               + self             = false
08:33:17.791 STDOUT [aws] terraform:               + to_port          = 0
08:33:17.792 STDOUT [aws] terraform:                 # (1 unchanged attribute hidden)
08:33:17.792 STDOUT [aws] terraform:             },
08:33:17.792 STDOUT [aws] terraform:         ]
08:33:17.792 STDOUT [aws] terraform:       + id                     = (known after apply)
08:33:17.792 STDOUT [aws] terraform:       + ingress                = [
08:33:17.792 STDOUT [aws] terraform:           + {
08:33:17.792 STDOUT [aws] terraform:               + cidr_b
08:33:17.792 STDOUT [aws] terraform: locks      = []
08:33:17.792 STDOUT [aws] terraform:               + from_port        = 8585
08:33:17.792 STDOUT [aws] terraform:               + ipv6_cidr_blocks = []
08:33:17.792 STDOUT [aws] terraform:               + prefix_list_ids  = []
08:33:17.792 STDOUT [aws] terraform:               + protocol         = "tcp"
08:33:17.792 STDOUT [aws] terraform:               + security_groups  = (known after apply)
08:33:17.792 STDOUT [aws] terraform:               + self             = false
08:33:17.792 STDOUT [aws] terraform:               + to_port          = 8585
08:33:17.792 STDOUT [aws] terraform:                 # (1 unchanged attribute hidden)
08:33:17.792 STDOUT [aws] terraform:             },
08:33:17.792 STDOUT [aws] terraform:         ]
08:33:17.792 STDOUT [aws] terraform:       + name                   = (known after apply)
08:33:17.792 STDOUT [aws] terraform:       + name_prefix            = (known after apply)
08:33:17.792 STDOUT [aws] terraform:       + owner_id               = (known after apply)
08:33:17.793 STDOUT [aws] terraform:       + region                 = "ap-northeast-1"
08:33:17.793 STDOUT [aws] terraform:       + revoke_rules_on_delete = false
08:33:17.793 STDOUT [aws] terraform:       + tags                   = {
08:33:17.793 STDOUT [aws] terraform:           + "Name" = "ethan-dev-sg-apne1-ecs"
08:33:17.793 STDOUT [aws] terraform:         }
08:33:17.793 STDOUT [aws] terraform:       + tags_all               = {
08:33:17.793 STDOUT [aws] terraform:           + "Name" = "ethan-dev-sg-apne1-ecs"
08:33:17.793 STDOUT [aws] terraform:         }
08:33:17.793 STDOUT [aws] terraform:       + vpc_id                 = (known after apply)
08:33:17.793 STDOUT [aws] terraform:     }
08:33:17.793 STDOUT [aws] terraform: Plan: 74 to add, 0 to change, 0 to destroy.
08:33:17.793 STDOUT [aws] terraform: 
```
</details>
